
AtlasLootClassicDB = {
	["profileKeys"] = {
		["白銀諾艾爾 - 碧玉矿洞"] = "白銀諾艾爾 - 碧玉矿洞",
		["白银兽骑团友 - 碧玉矿洞"] = "白银兽骑团友 - 碧玉矿洞",
		["白银兽骑团员 - 碧玉矿洞"] = "白银兽骑团员 - 碧玉矿洞",
		["白银兽骑团委 - 碧玉矿洞"] = "白银兽骑团委 - 碧玉矿洞",
	},
	["global"] = {
		["__addonrevision"] = 1010008,
	},
	["profiles"] = {
		["白銀諾艾爾 - 碧玉矿洞"] = {
			["minimap"] = {
				["minimapPos"] = 186.44156653537,
			},
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					5.33331489562988, -- [4]
					0, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"BlackrockDepths", -- [2]
					25, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["白银兽骑团友 - 碧玉矿洞"] = {
		},
		["白银兽骑团员 - 碧玉矿洞"] = {
			["GUI"] = {
				["selected"] = {
					"AtlasLootClassic_Crafting", -- [1]
					"Engineering", -- [2]
					4, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
			["minimap"] = {
				["minimapPos"] = 197.36267728892,
			},
		},
		["白银兽骑团委 - 碧玉矿洞"] = {
			["GUI"] = {
				["selected"] = {
					nil, -- [1]
					"Ragefire", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
	},
}
