
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"顺劈斩", -- [1]
				"烈焰震击", -- [2]
				"暗影箭", -- [3]
				"背刺", -- [4]
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["filt"] = {
			},
			["buffer"] = {
				["背刺"] = 0,
				["顺劈斩"] = 0,
				["烈焰震击"] = 0,
				["暗影箭"] = 0,
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"中伤之盾效果", -- [1]
				"真言术：盾", -- [2]
				"恢复", -- [3]
				"隐秘行动", -- [4]
				"防护暗影", -- [5]
				"心灵之火", -- [6]
				"暗影守卫", -- [7]
				"神圣之灵", -- [8]
				"喂养宠物效果", -- [9]
				"幽魂之狼", -- [10]
				"霜甲术", -- [11]
				"召唤地狱战马", -- [12]
				"闪现术", -- [13]
				"耐力", -- [14]
				"冰甲术", -- [15]
				"智力", -- [16]
				"胁迫", -- [17]
				"追踪人型生物", -- [18]
				"精神分流", -- [19]
				"奥术智慧", -- [20]
				"真言术：韧", -- [21]
				"强化格挡", -- [22]
				"远古之怒", -- [23]
				"战斗姿态", -- [24]
				"魔甲术", -- [25]
				"灵猴守护", -- [26]
				"冲锋", -- [27]
				"雄鹰守护", -- [28]
				"追踪野兽", -- [29]
				"猎豹守护", -- [30]
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["filt"] = {
			},
			["buffer"] = {
				["攻击"] = 0,
				["缩小"] = 0,
				["心灵震爆"] = 0,
				["闪电箭"] = 0,
				["自动射击"] = 0,
				["投掷"] = 0,
				["剥皮"] = 0,
				["治疗术"] = 0,
				["寒冰箭"] = 0,
				["暗影箭"] = 0,
				["射击"] = 0,
				["水晶凝视"] = 0,
				["火焰之盾 II"] = 0,
				["多重射击"] = 0,
				["毒性射击"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
				"剥皮", -- [1]
				"心灵震爆", -- [2]
				"寒冰箭", -- [3]
				"水晶凝视", -- [4]
				"治疗术", -- [5]
				"闪电箭", -- [6]
				"多重射击", -- [7]
				"自动射击", -- [8]
				"毒性射击", -- [9]
				"射击", -- [10]
				"攻击", -- [11]
				"缩小", -- [12]
				"暗影箭", -- [13]
				"投掷", -- [14]
				"火焰之盾 II", -- [15]
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["filt"] = {
			},
			["buffer"] = {
				["中伤之盾效果"] = 0,
				["心灵之火"] = 0,
				["闪现术"] = 0,
				["喂养宠物效果"] = 0,
				["胁迫"] = 0,
				["追踪野兽"] = 0,
				["幽魂之狼"] = 0,
				["真言术：盾"] = 0,
				["恢复"] = 0,
				["冰甲术"] = 0,
				["精神分流"] = 0,
				["霜甲术"] = 0,
				["战斗姿态"] = 0,
				["远古之怒"] = 0,
				["猎豹守护"] = 0,
				["奥术智慧"] = 0,
				["智力"] = 0,
				["召唤地狱战马"] = 0,
				["强化格挡"] = 0,
				["真言术：韧"] = 0,
				["隐秘行动"] = 0,
				["耐力"] = 0,
				["灵猴守护"] = 0,
				["暗影守卫"] = 0,
				["冲锋"] = 0,
				["神圣之灵"] = 0,
				["防护暗影"] = 0,
				["雄鹰守护"] = 0,
				["追踪人型生物"] = 0,
				["魔甲术"] = 0,
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["filt"] = {
			},
			["buffer"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
