
DCTSA_CONFIG = {
	["DCTSA_SAVE"] = {
		["DCTSA_FILTER_CASTSUCCESS_SORT"] = {
			["buffer"] = {
				"顺劈斩", -- [1]
				"烈焰震击", -- [2]
				"暗影箭", -- [3]
				"背刺", -- [4]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSUCCESS"] = {
			["buffer"] = {
				["背刺"] = 0,
				["顺劈斩"] = 0,
				["烈焰震击"] = 0,
				["暗影箭"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_SAVEDATA_VER"] = 2001,
		["DCTSA_FILTER_BUFF_SORT"] = {
			["buffer"] = {
				"心灵之火", -- [1]
				"喂养宠物效果", -- [2]
				"铁质盾刺", -- [3]
				"暗影守卫", -- [4]
				"灵魂石复活", -- [5]
				"猎豹形态", -- [6]
				"疾跑", -- [7]
				"冰甲术", -- [8]
				"奥术智慧", -- [9]
				"追踪野兽", -- [10]
				"水栖形态", -- [11]
				"追踪人型生物", -- [12]
				"真言术：韧", -- [13]
				"魔息术", -- [14]
				"吸取灵魂", -- [15]
				"冲锋", -- [16]
				"野性印记", -- [17]
				"治疗宠物", -- [18]
				"狂乱效果", -- [19]
				"力量", -- [20]
				"战斗姿态", -- [21]
				"魔甲术", -- [22]
				"敏捷", -- [23]
				"雄鹰守护", -- [24]
				"战斗怒吼", -- [25]
				"防御姿态", -- [26]
				"猎豹守护", -- [27]
				"突进", -- [28]
				"中伤之盾效果", -- [29]
				"真言术：盾", -- [30]
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART"] = {
			["buffer"] = {
				["攻击"] = 0,
				["缩小"] = 0,
				["火球术"] = 0,
				["自动射击"] = 0,
				["投掷"] = 0,
				["厚绒线绷带"] = 0,
				["水晶凝视"] = 0,
				["射击"] = 0,
				["多重射击"] = 0,
				["护甲 +24"] = 0,
				["献祭"] = 0,
				["闪电箭"] = 0,
				["毒性射击"] = 0,
				["腐蚀术"] = 0,
				["治疗术"] = 0,
				["暗影箭"] = 0,
				["火焰之盾 II"] = 0,
				["寒冰箭"] = 0,
				["剥皮"] = 0,
				["心灵震爆"] = 0,
				["炉石"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_DISPELLED_SORT"] = {
			["buffer"] = {
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_BUFF"] = {
			["buffer"] = {
				["心灵之火"] = 0,
				["突进"] = 0,
				["灵魂石复活"] = 0,
				["魔甲术"] = 0,
				["吸取灵魂"] = 0,
				["疾跑"] = 0,
				["战斗怒吼"] = 0,
				["喂养宠物效果"] = 0,
				["追踪野兽"] = 0,
				["冰甲术"] = 0,
				["追踪人型生物"] = 0,
				["铁质盾刺"] = 0,
				["战斗姿态"] = 0,
				["水栖形态"] = 0,
				["猎豹守护"] = 0,
				["中伤之盾效果"] = 0,
				["暗影守卫"] = 0,
				["冲锋"] = 0,
				["猎豹形态"] = 0,
				["真言术：韧"] = 0,
				["治疗宠物"] = 0,
				["魔息术"] = 0,
				["力量"] = 0,
				["敏捷"] = 0,
				["奥术智慧"] = 0,
				["野性印记"] = 0,
				["防御姿态"] = 0,
				["雄鹰守护"] = 0,
				["真言术：盾"] = 0,
				["狂乱效果"] = 0,
			},
			["filt"] = {
			},
		},
		["DCTSA_FILTER_CASTSTART_SORT"] = {
			["buffer"] = {
				"护甲 +24", -- [1]
				"炉石", -- [2]
				"厚绒线绷带", -- [3]
				"献祭", -- [4]
				"腐蚀术", -- [5]
				"火球术", -- [6]
				"剥皮", -- [7]
				"心灵震爆", -- [8]
				"寒冰箭", -- [9]
				"水晶凝视", -- [10]
				"治疗术", -- [11]
				"闪电箭", -- [12]
				"多重射击", -- [13]
				"自动射击", -- [14]
				"毒性射击", -- [15]
				"射击", -- [16]
				"攻击", -- [17]
				"缩小", -- [18]
				"暗影箭", -- [19]
				"投掷", -- [20]
				"火焰之盾 II", -- [21]
			},
			["filt"] = {
			},
		},
		["PROFILE"] = {
		},
	},
}
