
_detalhes_global = {
	["npcid_pool"] = {
		[12236] = "维利塔恩",
		[4113] = "砂齿掘地工",
		[6168] = "鲁古格",
		[1551] = "铁腭蜥蜴",
		[8318] = "阿塔莱奴隶",
		[1557] = "老迈的迷雾谷猩猩",
		[6232] = "施法者克星X-21",
		[1561] = "血帆袭击者",
		[391] = "老瞎眼",
		[1565] = "血帆水手",
		[4249] = "杂毛嚎叫者",
		[8510] = "阿塔莱图腾 <祖罗>",
		[8542] = "死亡歌手",
		[4289] = "血色招魂师",
		[4297] = "血色咒术师",
		[8606] = "腐朽软泥怪",
		[4329] = "火鬃斥候",
		[4361] = "黑鳍泥浆鱼人",
		[4393] = "酸性沼泽软泥怪",
		[3225] = "Chalice",
		[4417] = "迪菲亚工头",
		[3241] = "披着狮皮的汪",
		[3245] = "暴躁的平原陆行鸟",
		[4457] = "黑腮强盗",
		[4465] = "邪枝标枪手",
		[6520] = "灼热元素",
		[8958] = "怒爪巨熊",
		[6552] = "格里什工蝎",
		[412] = "未知目标",
		[1653] = "血帆大法师",
		[9166] = "翼手龙",
		[1663] = "迪克斯特·瓦德",
		[417] = "弗拉霍恩",
		[4657] = "玛洛迪逐风者",
		[4681] = "法师猎手",
		[422] = "鱼人食腐者",
		[423] = "混血赤脊山豺狼人",
		[1693] = "洛克鳄",
		[424] = "赤脊山偷猎者",
		[13596] = "洛特格里普",
		[426] = "赤脊山蛮兵",
		[1707] = "迪菲亚俘虏",
		[3417] = "活火",
		[1711] = "迪菲亚罪犯",
		[1713] = "老年深喉猎豹",
		[1715] = "迪菲亚叛军",
		[1717] = "哈姆霍克",
		[430] = "赤脊山秘法师",
		[431] = "暗皮杀手",
		[1725] = "迪菲亚哨兵",
		[1727] = "迪菲亚工人",
		[1729] = "迪菲亚招魂师",
		[433] = "暗皮豺狼人",
		[434] = "疯狂的暗皮豺狼人",
		[435] = "黑石勇士",
		[436] = "黑石暗影法师",
		[437] = "黑石叛节者",
		[4969] = "旧城区暴徒",
		[440] = "黑石步兵",
		[7040] = "黑色龙人",
		[1763] = "基尔尼格",
		[442] = "狼蛛",
		[445] = "赤脊山突击队员",
		[7120] = "加德纳尔术士",
		[1783] = "骷髅剥皮者",
		[5089] = "巴鲁斯·加科因",
		[3573] = "法力之泉图腾 <蒙牛代言人>",
		[1789] = "骷髅侍僧",
		[448] = "霍格",
		[449] = "迪菲亚拳匪",
		[452] = "河爪强盗",
		[8319] = "噩梦雏龙",
		[454] = "炸猪排",
		[7272] = "殉教者塞卡",
		[5241] = "戈杜尼军阀",
		[3653] = "海龟",
		[7320] = "石窟虐待者",
		[7328] = "枯萎掠夺者",
		[8527] = "天灾卫兵",
		[5297] = "老年怒痕雪人",
		[7352] = "冰冻之魂",
		[7376] = "暗影鹫",
		[5337] = "憎世海妖",
		[7400] = "灼热图腾 V",
		[5361] = "被缩小的波涛巨人",
		[7440] = "冬泉巢穴守卫",
		[7448] = "冰风奇美拉",
		[7464] = "熔岩图腾 II <阿忠灬饭店>",
		[5425] = "饥饿的疱爪土狼",
		[1871] = "伊莉莎的卫兵 <伊莉莎>",
		[5441] = "哈扎里异种蝎",
		[5457] = "森提帕尔群居蝎",
		[5473] = "砂槌食人魔法师",
		[5481] = "灌木露水收集者",
		[8959] = "魔爪狼",
		[474] = "迪菲亚流浪巫师",
		[475] = "狗头人隧道工",
		[7608] = "穆尔塔",
		[3809] = "曹你大嘴",
		[1907] = "纳迦探险者",
		[478] = "河爪豺狼人前锋",
		[3825] = "狼",
		[9167] = "狂怒的翼手龙",
		[30] = "森林蜘蛛",
		[5649] = "沙怒饮血者",
		[3853] = "影牙夜行者",
		[3861] = "灰色座狼",
		[485] = "黑石前锋",
		[5713] = "加什尔",
		[5721] = "德姆塞卡尔",
		[7800] = "麦克尼尔·瑟玛普拉格",
		[3913] = "未知目标",
		[3917] = "污浊的水元素",
		[7848] = "潜伏的深痕雪人",
		[7856] = "南海劫掠者",
		[7864] = "徘徊的上层精灵",
		[5833] = "狂暴的玛尔戈",
		[5865] = "骑猪瞎逛",
		[1981] = "黑铁伏击者",
		[11790] = "腐烂萨特",
		[3977] = "大检察官怀特迈恩",
		[5913] = "战栗图腾 <格瑞姆洛克>",
		[5929] = "熔岩图腾 <枯木巫医>",
		[11886] = "米库提奥·污血",
		[8016] = "贫瘠之地卫兵",
		[5977] = "巨槌战士",
		[5993] = "地狱野猪",
		[504] = "迪菲亚捕兽者",
		[6017] = "熔岩喷射图腾 <流亡者赞吉尔>",
		[505] = "巨型狼蛛",
		[4041] = "炭色石化蜥蜴",
		[10079] = "卫兵穆赫·月角",
		[8120] = "苏利萨斯憎恶",
		[4065] = "黑石哨兵",
		[8136] = "沙尔扎鲁",
		[12206] = "原始巨兽",
		[12222] = "爬行污泥怪",
		[511] = "疯狂的食尸鬼",
		[4114] = "砂齿抢劫者",
		[517] = "鱼人智者",
		[2070] = "月夜猛虎幼崽",
		[4154] = "盐湖食腐鹫",
		[8336] = "哈卡莱挖掘者",
		[6225] = "步行坦克",
		[6233] = "机械哨兵",
		[8384] = "神庙深渊潜伏者",
		[8400] = "奥比斯顿",
		[14621] = "工头玛托留斯",
		[533] = "夜行织影狼人",
		[8528] = "恐怖编织者",
		[6329] = "辐射抢劫者",
		[4290] = "血色卫兵",
		[4298] = "血色防御者",
		[539] = "小型结网毒蜘蛛",
		[8656] = "未知目标 <胡库>",
		[545] = "鱼人招潮者",
		[4362] = "黑鳍滩行鱼人",
		[4378] = "暗雾独行蛛",
		[4386] = "枯藤断木者",
		[2202] = "灰雾滩行者",
		[4418] = "迪菲亚巫师",
		[4442] = "剃刀沼泽防御者",
		[6505] = "暴掠龙",
		[4466] = "邪枝割颅者",
		[6521] = "有生烈焰",
		[8960] = "魔爪食腐狼",
		[2246] = "辛迪加刺客",
		[2250] = "山岭雪人",
		[6553] = "格里什劫掠者",
		[4514] = "我是你巴巴",
		[4522] = "剃刀沼泽织尘者",
		[4538] = "蝙蝠",
		[569] = "绿色独行蛛",
		[570] = "食脑者",
		[575] = "火元素",
		[578] = "鱼人斥候",
		[579] = "暗皮刺客",
		[4634] = "科卡尔虐待者",
		[587] = "血顶战士",
		[2350] = "森林食苔蛛",
		[2354] = "邪恶的灰熊",
		[590] = "迪菲亚强夺者",
		[594] = "迪菲亚匪徒",
		[595] = "血顶猎人",
		[597] = "血顶狂战士",
		[598] = "迪菲亚矿工",
		[599] = "玛里莎·杜派格",
		[4802] = "黑暗深渊海潮祭司",
		[2406] = "山地狮",
		[604] = "瘟疫食尸鬼",
		[4850] = "石窟潜伏者",
		[6913] = "失落裂隙行者",
		[11791] = "腐烂欺骗者",
		[9776] = "喷焰小鬼",
		[615] = "黑石追踪者",
		[11887] = "地穴抢劫者",
		[619] = "迪菲亚咒术师",
		[622] = "地精工程师",
		[623] = "骷髅矿工",
		[7033] = "火腹食人魔",
		[625] = "亡灵爆破者",
		[626] = "工头希斯耐特",
		[628] = "黑色破坏者",
		[2522] = "丛林猎豹",
		[7097] = "未知目标",
		[7105] = "碧火萨特",
		[7113] = "加德纳尔守护者",
		[12207] = "塞萨拉多头怪",
		[2546] = "舰队指挥官菲尔拉伦",
		[12239] = "吉尔克",
		[2554] = "枯木掷斧者",
		[2558] = "未知目标",
		[2562] = "石拳食人魔",
		[642] = "斯尼德的伐木机",
		[643] = "斯尼德 <斯尼德的伐木机>",
		[2574] = "枯须掘地工",
		[2578] = "山地秃鹰幼崽",
		[646] = "重拳先生",
		[2586] = "辛迪加路霸",
		[8337] = "黑铁塑钢师",
		[5226] = "黑暗虫",
		[5234] = "戈杜尼虐待者",
		[657] = "迪菲亚海盗",
		[5258] = "木爪突击队员",
		[5274] = "铁鬃熊王",
		[2642] = "邪枝暗影法师",
		[2646] = "邪枝饮血者",
		[2650] = "枯木狂热者",
		[7353] = "寒冰之灵",
		[667] = "劈颅战士",
		[669] = "劈颅猎人",
		[670] = "劈颅巫医",
		[5362] = "北泉鹰身人",
		[672] = "劈颅逐灵者",
		[674] = "风险投资公司露天矿工",
		[7441] = "冬泉图腾师",
		[676] = "风险投资公司勘探员",
		[7457] = "游荡的冰蓟雪人",
		[678] = "莫什奥格虐待者",
		[5426] = "疱爪土狼",
		[2718] = "火烟萨满祭司",
		[681] = "荆棘谷猛虎幼崽",
		[2726] = "烈焰守护者",
		[5458] = "森提帕尔工蝎",
		[684] = "陆六六",
		[5474] = "砂槌蛮兵",
		[686] = "鞭尾迅猛龙",
		[5490] = "长瘤的灌木兽",
		[688] = "石喉蜥蜴",
		[689] = "晶背蜥蜴",
		[690] = "冷眼蜥蜴",
		[2762] = "雷霆流放者",
		[694] = "血顶掷斧者",
		[696] = "劈颅掷斧者",
		[697] = "血顶萨满祭司",
		[698] = "血顶猛虎",
		[699] = "血顶兽王",
		[701] = "血顶秘法师",
		[702] = "血顶食腐者",
		[5618] = "废土强盗",
		[706] = "霜鬃巨魔幼崽",
		[5650] = "沙怒巫医",
		[2830] = "秃鹫",
		[709] = "莫什奥格好战者",
		[710] = "莫什奥格法师",
		[711] = "阿尔多·泥爪",
		[712] = "赤脊山鞭笞者",
		[2850] = "断了个牙",
		[5714] = "洛若尔",
		[5722] = "哈扎斯",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[11552] = "木喉秘法师",
		[2894] = "石窟萨满祭司",
		[7849] = "移动警报系统",
		[2906] = "火烟战士",
		[728] = "巴尔瑟拉",
		[729] = "豹",
		[730] = "泰希斯",
		[5842] = "迅猛龙",
		[13743] = "腐化的自然之力",
		[5858] = "巨型熔岩蜘蛛",
		[46] = "鱼人强盗",
		[736] = "黑豹",
		[2946] = "未知目标",
		[11792] = "腐烂巡影者",
		[2958] = "草原狼",
		[741] = "睡梦雏龙",
		[742] = "绿色龙族",
		[743] = "龙族巡梦者",
		[744] = "绿色刃鳞龙人",
		[745] = "刃鳞龙人队长",
		[746] = "刃鳞龙人长者",
		[747] = "沼泽鱼人",
		[5978] = "巨槌术士",
		[750] = "沼泽喷墨鱼人",
		[751] = "沼泽食腐鱼人",
		[6010] = "地狱巨犬",
		[755] = "泥泞失落者",
		[756] = "劈颅黑豹 <劈颅猎人>",
		[757] = "失落者渔夫",
		[6066] = "陷地图腾 <血顶巫医>",
		[760] = "失落定居者",
		[761] = "失落者先知",
		[762] = "失落寻隙者",
		[764] = "沼泽漫步者",
		[14271] = "雷布查斯",
		[12240] = "考尔克",
		[767] = "沼泽虎",
		[768] = "暗影黑豹",
		[769] = "死亡狼蛛",
		[4107] = "风巢双足飞龙",
		[772] = "荆棘谷雌虎",
		[4139] = "恐蝎",
		[4147] = "盐石蜥蜴",
		[6210] = "洞窟抢劫者",
		[12432] = "未知目标",
		[6226] = "机械烈焰行者",
		[780] = "劈颅秘法师",
		[781] = "劈颅猎头者",
		[782] = "劈颅斥候",
		[783] = "劈颅狂战士",
		[784] = "劈颅兽王",
		[785] = "骷髅看守",
		[787] = "骷髅医师",
		[4283] = "血色哨兵",
		[4291] = "血色教士",
		[4299] = "血色牧师",
		[8658] = "胡库的小鬼 <胡库>",
		[6386] = "赞吉尔结界 <流亡者赞吉尔>",
		[4363] = "黑鳍智者",
		[4387] = "枯藤沼泽兽",
		[808] = "冷酷的格瑞克尼尔",
		[4435] = "剃刀沼泽战士",
		[813] = "库尔森上校",
		[3258] = "刺背猎手",
		[818] = "麦佐斯",
		[819] = "伊尔加拉的仆从",
		[6554] = "格里什毒刺蝎",
		[4515] = "亡首侍僧",
		[4523] = "剃刀沼泽震地者",
		[4531] = "剃刀沼泽驯兽师",
		[824] = "迪菲亚掘地工",
		[832] = "尘魔",
		[833] = "山狗首领",
		[834] = "山狗",
		[13456] = "未知目标 <诺克赛恩>",
		[4723] = "工头考兹尔",
		[11521] = "科多幽灵",
		[11553] = "木喉折木者",
		[854] = "幼年丛林捕猎者",
		[855] = "幼年荆棘谷迅猛龙",
		[856] = "幼年鞭尾迅猛龙",
		[13696] = "诺克赛恩幼体",
		[858] = "沼泽纺丝蛛",
		[861] = "斯通纳德斥候",
		[862] = "斯通纳德探险者",
		[4851] = "石窟嚼石者",
		[11777] = "暗影碎片巡游者",
		[866] = "斯通纳德步兵",
		[9778] = "火炬小鬼",
		[871] = "盐鳞战士",
		[873] = "盐鳞智者",
		[875] = "盐鳞首领",
		[877] = "盐鳞强盗",
		[879] = "盐鳞猎人",
		[7034] = "火腹食人魔法师",
		[10082] = "泽雷利斯",
		[889] = "裂拳食人魔",
		[7114] = "加德纳尔执行者",
		[891] = "裂拳控火者",
		[892] = "裂拳工头",
		[12225] = "被诅咒的塞雷布拉斯",
		[7154] = "死木园丁",
		[3586] = "矿工约翰森",
		[898] = "夜行狼人",
		[7226] = "未知目标 <古代的石头看守者>",
		[905] = "利齿狂鱼",
		[3630] = "风蛇",
		[909] = "迪菲亚夜贼",
		[910] = "迪菲亚附魔师",
		[8419] = "暮光崇拜者",
		[7290] = "暗炉狙击手",
		[5251] = "木爪捕兽者",
		[5259] = "阿塔莱巫医",
		[5267] = "阿塔莱行尸",
		[5283] = "噩梦游荡者",
		[5291] = "哈卡莱霜翼飞蛇",
		[7346] = "碎骨百夫长",
		[920] = "夜行堕落狼人",
		[923] = "黑色破坏者幼崽",
		[8675] = "未知目标",
		[10738] = "冬泉酋长",
		[930] = "小型黑寡妇蜘蛛",
		[7442] = "冬泉探路者",
		[7450] = "蓬毛枭兽",
		[7458] = "冰蓟雪人",
		[5419] = "晶鳞蜥蜴",
		[5427] = "疯狂的疱爪土狼",
		[937] = "库尔森丛林战士",
		[3750] = "污林图腾师",
		[939] = "库尔森精英",
		[940] = "库尔森药草师",
		[941] = "库尔森精神医师",
		[942] = "库尔森巫医",
		[943] = "库尔森驯兽师",
		[946] = "霜鬃巨魔新兵",
		[948] = "腐烂者",
		[949] = "食腐独行蛛",
		[3810] = "熊",
		[3862] = "被奴役的座狼",
		[5715] = "胡库",
		[7786] = "祖穆拉恩骷髅",
		[976] = "库尔森战虎",
		[3906] = "治疗之泉图腾 II <蔓婷莎>",
		[978] = "库尔森副首领",
		[3914] = "雷希戈尔",
		[7858] = "南海流氓",
		[5843] = "奴隶工",
		[9683] = "拉克维的配偶",
		[11778] = "暗影碎片击碎者",
		[3974] = "驯犬者洛克希",
		[4006] = "深苔结网蛛",
		[4014] = "雄性巨翼双足飞龙",
		[4022] = "血怒鹰身人",
		[1007] = "藓皮豺狼人",
		[1008] = "混血藓皮豺狼人",
		[1009] = "藓皮织雾者",
		[4038] = "燃烧的破坏者",
		[1011] = "藓皮捕兽者",
		[1012] = "藓皮蛮兵",
		[4062] = "黑铁投弹手",
		[8138] = "苏利萨斯幼崽",
		[8146] = "拉乌",
		[1020] = "杂斑迅猛龙",
		[1021] = "杂斑尖啸龙",
		[12242] = "玛拉多斯",
		[12258] = "锐刺鞭笞者",
		[1024] = "蓝腮鱼人",
		[1026] = "蓝腮强盗",
		[1028] = "蓝腮泥浆鱼人",
		[1030] = "黑色泥浆怪",
		[4124] = "千针石林山狮",
		[1034] = "龙喉袭击者",
		[1036] = "龙喉百夫长",
		[6195] = "恶鞭海妖",
		[1040] = "沼泽爬行者",
		[8324] = "未知目标",
		[6219] = "酸性潜伏者",
		[6227] = "机械冰霜行者",
		[6235] = "电刑器6000型",
		[4196] = "异种蝎群",
		[2103] = "龙喉斥候",
		[10467] = "法力之潮图腾 <捶腰磁爆步兵>",
		[1060] = "死灵莫格",
		[1062] = "可怕的奈兹里奥克",
		[4260] = "风险投资公司伐木机",
		[8532] = "生病的剥皮者",
		[4284] = "血色预言师",
		[8580] = "阿塔拉利恩",
		[8596] = "瘟疫幼犬",
		[2163] = "蓟熊",
		[2167] = "黑木探路者",
		[4356] = "血沼刺喉龙",
		[1094] = "风险投资公司矿工",
		[1096] = "风险投资公司地质学家",
		[4404] = "污壳狂钳龙虾人",
		[4420] = "主宰拉姆塔斯",
		[4428] = "亡语者贾格巴",
		[1110] = "骷髅袭击者",
		[1112] = "吸血寡妇",
		[1114] = "丛林大猩猩",
		[1116] = "石腭伏击者",
		[4468] = "玉石淤泥怪",
		[1120] = "霜鬃巨魔",
		[2243] = "辛迪加哨兵",
		[2247] = "未知目标",
		[8996] = "未知目标 <迪菲亚咒术师>",
		[2255] = "破碎岭法师",
		[4516] = "亡首专家",
		[4532] = "剃刀沼泽兽王",
		[4540] = "血色僧侣",
		[4548] = "钢齿土狼",
		[1142] = "莫什奥格蛮兵",
		[2287] = "破碎岭好战者",
		[13282] = "诺克赛恩",
		[1152] = "钳嘴鳄鱼",
		[1158] = "被诅咒的水兵",
		[4636] = "科卡尔队长",
		[1162] = "碎石怪斥候",
		[1164] = "碎石怪断骨者",
		[1166] = "碎石怪先知",
		[4676] = "次级地狱火",
		[1172] = "坑道鼠歹徒",
		[1174] = "坑道鼠地卜师",
		[9396] = "震地者",
		[1178] = "莫格罗什食人魔",
		[1180] = "莫格罗什蛮兵",
		[1184] = "峭壁潜伏者",
		[2371] = "刺脊海妖",
		[2375] = "碎鳍滩行鱼人",
		[11555] = "独眼高恩",
		[1194] = "山鹫",
		[1196] = "冰爪熊",
		[1200] = "摩本特·费尔",
		[2407] = "巨型山地狮",
		[6867] = "寻迹犬",
		[1210] = "卓克苏尔",
		[2423] = "奥里登·匹瑞诺德领主",
		[4852] = "石窟智者",
		[2431] = "看守员博胡恩",
		[1222] = "黑铁工兵",
		[2447] = "纳瑞尔拉萨斯",
		[7011] = "土灵碎岩者",
		[10036] = "蕨墙执行者",
		[1258] = "巨型黑色破坏者",
		[2523] = "灼热图腾 <飞暴>",
		[7099] = "猫头鹰",
		[2531] = "莫甘斯的爪牙",
		[2535] = "“畸形足”玛雷·维尔金斯",
		[1270] = "恶臭的食尸鬼",
		[2547] = "艾隆帕",
		[12243] = "温格",
		[2555] = "枯木巫医",
		[2559] = "高地阔步龙",
		[2563] = "平原狼蛛",
		[2567] = "石拳法师",
		[2571] = "石拳领主",
		[2575] = "黑铁后勤兵",
		[2587] = "辛迪加巡路者",
		[2595] = "刺脊袭击者",
		[7267] = "乌克兹·沙顶",
		[7275] = "暗影祭司塞瑟斯",
		[5236] = "戈杜尼萨满祭司",
		[7291] = "加加恩·火锤",
		[5260] = "格罗多克猿人",
		[2635] = "老海鳄",
		[2639] = "邪枝掷斧者",
		[2643] = "邪枝狂战士",
		[2647] = "邪枝噬魂者",
		[7347] = "嚼骨食尸鬼",
		[7355] = "图特卡什",
		[8597] = "瘟疫犬",
		[2667] = "懒惰结界",
		[5364] = "北泉杀戮者",
		[7443] = "碎齿暴熊",
		[7451] = "狂怒的枭兽",
		[5420] = "晶鳞凝视者",
		[5428] = "大鹏",
		[2719] = "火烟领主",
		[2723] = "石头傀儡",
		[1364] = "邪恶的巴尔加拉斯",
		[2731] = "山脊巡行者",
		[2735] = "次级石元素",
		[7523] = "受难的上层精灵",
		[2743] = "暗炉战士",
		[2759] = "赫玛图斯",
		[2763] = "瑟恩纳",
		[1388] = "瓦加什",
		[7603] = "麻疯助手",
		[2791] = "被激怒的石元素",
		[1400] = "湿地鳄鱼",
		[2831] = "巨型秃鹫",
		[1418] = "蓝腮袭击者",
		[5708] = "哈卡的后代",
		[5716] = "祖罗尔",
		[7787] = "沙怒奴隶",
		[7795] = "水占师维蕾萨",
		[7803] = "沙漠掘洞蝎",
		[9477] = "克隆软泥怪 <原生软泥怪>",
		[2907] = "火烟秘法师",
		[5828] = "兜兜齿儿",
		[2919] = "法姆雷托守护者",
		[5844] = "黑铁奴隶贩子",
		[2927] = "邪恶的枭兽",
		[5860] = "暮光黑暗萨满祭司",
		[7915] = "步行炸弹",
		[92] = "石元素",
		[1488] = "赞吉尔僵尸",
		[9861] = "米莱恩",
		[1492] = "高拉什",
		[8035] = "黑铁地雷 <黑铁密探>",
		[6004] = "魔誓祭司",
		[1514] = "野蛮的莫克",
		[1516] = "康达",
		[95] = "迪菲亚走私者",
		[8147] = "莫沙彻营地卫兵",
		[6132] = "剃刀沼泽仆从",
		[4109] = "雄性风巢飞龙",
		[6180] = "迪菲亚袭击者",
		[1550] = "钢尾蜥蜴",
		[6212] = "黑铁密探",
		[6220] = "辐射水元素",
		[1558] = "银背雌猩猩",
		[1562] = "血帆法师",
		[1564] = "血帆术士",
		[98] = "河爪监工",
		[8438] = "哈卡莱护血者",
		[8566] = "黑铁哨兵",
		[4301] = "血色百夫长",
		[6388] = "赞吉尔骷髅",
		[4357] = "血沼鞭尾龙",
		[6412] = "骷髅 <龙喉白骨守卫>",
		[4405] = "污壳锐爪龙虾人",
		[4413] = "暗牙蜘蛛",
		[4421] = "卡尔加·刺肋",
		[3239] = "电角蜥蜴",
		[4437] = "剃刀沼泽守卫",
		[3247] = "雷鹰雏鸟",
		[6500] = "霸王魔暴龙",
		[6508] = "毒皮暴掠龙",
		[6556] = "胶质软泥怪",
		[4525] = "剃刀沼泽裂地者",
		[4541] = "阿迦玛甘之血",
		[1666] = "卡姆·深怒",
		[9318] = "熏火龙",
		[1696] = "可怕的塔格尔",
		[11557] = "梅罗什",
		[1706] = "迪菲亚囚徒",
		[1708] = "迪菲亚狱友",
		[1716] = "巴基尔·斯瑞德",
		[1718] = "石腭袭击者",
		[4845] = "暗炉恶棍",
		[4853] = "石窟地占师",
		[4861] = "蝙蝠",
		[11781] = "琥珀碎片摧毁者",
		[1732] = "迪菲亚塑风师",
		[3475] = "新白娘子",
		[9862] = "加德纳尔军团士兵",
		[9878] = "热能野兽",
		[7012] = "土灵雕刻者",
		[7036] = "索瑞森间谍",
		[7044] = "黑色幼龙",
		[3527] = "治疗之泉图腾 <卧槽我卡了>",
		[3531] = "月怒裁缝",
		[7076] = "土灵守护者",
		[7092] = "被污染的软泥怪",
		[7100] = "曲木食苔者",
		[7108] = "碧火背叛者",
		[1788] = "骷髅军官",
		[7156] = "死木守卫",
		[1794] = "没有灵魂的食尸鬼",
		[14356] = "锯鳍狂鱼",
		[14388] = "游荡的黑龙",
		[7228] = "艾隆纳亚",
		[3619] = "绿巨人",
		[1816] = "生病的灰熊",
		[8391] = "黑衣拉索里克",
		[7276] = "未知目标",
		[114] = "看守傀儡",
		[5253] = "木爪蛮兵",
		[5261] = "被奴役的阿塔莱巨魔",
		[5269] = "阿塔莱祭司",
		[5277] = "噩梦刃鳞龙人",
		[7332] = "枯萎矛鬃野猪人",
		[8535] = "腐烂的尖啸者",
		[8551] = "黑暗召唤师",
		[8567] = "暴食者",
		[5333] = "憎世毒蛇守卫",
		[7396] = "土灵破石者",
		[116] = "迪菲亚强盗",
		[3711] = "怒尾侍从",
		[10758] = "恐怖图腾强盗",
		[1860] = "卡尔克雷斯",
		[7444] = "熊",
		[7452] = "疯狂的枭兽",
		[7460] = "冰蓟雪人王",
		[5421] = "晶鳞石化蜥蜴",
		[5429] = "火鹏",
		[3743] = "污林战士",
		[5453] = "哈扎里掘洞蝎",
		[5461] = "海元素",
		[7524] = "痛苦的上层精灵",
		[5485] = "灌木塑根者",
		[118] = "觅食的灰狼",
		[1896] = "月怒长者",
		[13141] = "深腐践踏者",
		[7604] = "布莱中士",
		[3823] = "幽爪奔跑者",
		[1922] = "森林灰狼",
		[5645] = "沙怒剥皮者",
		[3851] = "影牙白头狼人",
		[7732] = "复制虫 <尖端机器人>",
		[5709] = "伊兰尼库斯的阴影",
		[5717] = "米杉",
		[7788] = "沙怒苦工",
		[122] = "迪菲亚路霸",
		[3903] = "灼热图腾 III <黑暗的猫>",
		[3907] = "治疗之泉图腾 III",
		[11558] = "克尔达",
		[7844] = "火焰新星图腾 IV <安图苏尔>",
		[11686] = "鬼魅掠夺者",
		[5853] = "温和的作战傀儡",
		[5861] = "暮光火焰卫士",
		[124] = "河爪蛮兵",
		[11782] = "琥珀碎片毁灭者",
		[3975] = "赫洛德",
		[5925] = "根基图腾 <蔓婷莎>",
		[7996] = "守护者奇尔加",
		[9879] = "热能恐兽",
		[4011] = "幼年巨翼双足飞龙",
		[5981] = "传送门搜寻者",
		[6005] = "魔誓暴徒",
		[4031] = "奇美拉雏兽",
		[6021] = "野猪之魂 <阿格姆>",
		[127] = "潮行鱼人",
		[4067] = "夜行虎",
		[8156] = "未知目标 <安图苏尔>",
		[6117] = "上层精灵鬼巫",
		[4110] = "雌性风巢飞龙",
		[4118] = "毒性风蛇",
		[4126] = "XD",
		[4142] = "海龟",
		[4150] = "盐石凝视者",
		[4158] = "盐湖秃鹫",
		[6213] = "辐射入侵者",
		[6221] = "混乱的麻疯侏儒",
		[8408] = "军阀克雷利安",
		[8440] = "哈卡的化身",
		[8504] = "黑铁斥候",
		[4286] = "血色士兵",
		[4294] = "血色魔术师",
		[4302] = "血色勇士",
		[14757] = "断齿长者",
		[4342] = "尘泥锐爪鳄鱼",
		[4358] = "黑鳍污水鱼人",
		[7025] = "黑石士兵",
		[16117] = "大哥",
		[2858] = "格林戈",
		[7340] = "骷髅暗影法师 <骷髅召唤者>",
		[979] = "库尔森暗影猎手",
		[4414] = "暗牙毒蜘蛛",
		[7041] = "火鳞龙人",
		[7112] = "加德纳尔祭司",
		[4438] = "剃刀沼泽刺鬃守卫",
		[7348] = "噬棘食尸鬼",
		[416] = "盖尔祖布",
		[4462] = "黑石猎人",
		[6517] = "焦油兽",
		[2240] = "辛迪加劫匪",
		[977] = "库尔森战豹",
		[2248] = "洞穴雪人",
		[2252] = "破碎岭食人魔",
		[2256] = "破碎岭执行者",
		[4518] = "亡首圣贤",
		[4526] = "风嚎者",
		[4534] = "被驯服的土狼",
		[4542] = "大检察官法尔班克斯",
		[731] = "浩克",
		[6224] = "麻疯机械师",
		[5273] = "阿塔莱高阶祭司",
		[121] = "迪菲亚巡路者",
		[6557] = "原生软泥怪",
		[12224] = "洞窟游荡者",
		[6208] = "洞窟入侵者",
		[9462] = "血喉酋长",
		[4034] = "狂怒的石灵",
		[97] = "矮小的河爪豺狼人",
		[9377] = "空气漩涡",
		[2320] = "纳伽兹",
		[6196] = "恶鞭侍从",
		[4654] = "玛洛迪斥候",
		[48] = "骷髅战士",
		[765] = "沼泽漫步者长老",
		[759] = "失落者猎人",
		[6733] = "石窟猛击者",
		[2348] = "老食苔蛛",
		[4029] = "黑色古树",
		[2356] = "老灰熊",
		[8598] = "狂怒的瘟疫犬",
		[4726] = "暴怒的雷霆蜥蜴",
		[9464] = "主宰洛尔",
		[2372] = "泥嘴豺狼人",
		[2376] = "碎鳍智者",
		[11559] = "玛格拉姆通灵师",
		[2384] = "饥饿的山地狮",
		[11793] = "塞雷布拉斯树妖",
		[1778] = "熊",
		[1731] = "地精工匠",
		[94] = "迪菲亚小偷",
		[1490] = "赞吉尔巫医",
		[13718] = "无名预言者",
		[11687] = "鬼魅袭击者",
		[2416] = "破碎岭掠夺者",
		[2420] = "塔尔格",
		[4846] = "暗炉掘地工",
		[2428] = "狱卒玛尔根",
		[2950] = "白鬃剥皮工",
		[11783] = "瑟莱德丝碎片 <瑟莱德丝卫士>",
		[2440] = "醉酒的劫匪",
		[3989] = "风险投资公司樵夫",
		[2351] = "灰熊",
		[2929] = "野蛮的枭兽",
		[4857] = "石头看守者",
		[4849] = "暗炉考古学家",
		[5852] = "地狱元素",
		[5244] = "祖卡什毒刺蝎",
		[14445] = "维尔玛克将军",
		[752] = "沼泽鱼人智者",
		[2551] = "布鲁图斯",
		[4966] = "亨德尔下士",
		[8497] = "噩梦镇压者",
		[115] = "收割傀儡",
		[7037] = "索瑞森驭火者",
		[13142] = "深腐纠缠者",
		[5307] = "山谷尖啸者",
		[9877] = "萨瓦利斯王子",
		[10040] = "格里什虫巢卫士",
		[7077] = "土灵筑厅师",
		[2520] = "遥控傀儡 <地精工程师>",
		[7093] = "邪恶的软泥怪",
		[7101] = "曲木撕裂者",
		[7109] = "碧火魔仆",
		[2536] = "火柴棍乔乔",
		[7125] = "加德纳尔恶犬",
		[1863] = "里恩里斯",
		[2548] = "尼哈鲁船长",
		[2552] = "枯木巨魔",
		[2556] = "枯木猎头者",
		[2560] = "高地长尾龙",
		[2564] = "石拳执行者",
		[5452] = "哈扎里工蝎",
		[2572] = "枯须狗头人",
		[1380] = "赛恩",
		[2580] = "老山地秃鹰",
		[4461] = "黑腮战士",
		[2588] = "辛迪加潜伏者",
		[2592] = "顽石流放者",
		[2596] = "刺脊巫师",
		[6555] = "格里什掘洞蝎",
		[4505] = "血帆桨手",
		[2686] = "枯木巢穴守卫",
		[5308] = "一阵风",
		[7309] = "土灵管理者",
		[5238] = "戈杜尼军官",
		[2624] = "加兹班",
		[5254] = "木爪秘法师",
		[5262] = "格罗多克大猩猩",
		[5270] = "阿塔莱食尸者",
		[2640] = "邪枝巫医",
		[2644] = "邪枝剥皮者",
		[2648] = "邪枝精英卫兵",
		[2652] = "枯木毒血巨魔",
		[2656] = "玉石软泥怪",
		[8585] = "未知目标 <寒冰之王亚门纳尔>",
		[10648] = "萨瓦里克",
		[2734] = "未知目标",
		[5332] = "憎世御浪者",
		[2676] = "微型收割机",
		[2680] = "邪枝狼崽",
		[5366] = "北泉唤风者",
		[2714] = "被遗忘者信使",
		[1186] = "老黑熊",
		[4506] = "血帆水兵",
		[7274] = "沙怒刽子手",
		[7453] = "月光枭兽",
		[5454] = "哈扎里沙行者",
		[5422] = "沙漠猎食蝎",
		[2716] = "火烟猎龙者",
		[2720] = "火烟食人魔法师",
		[5462] = "巨型海元素",
		[2728] = "狼",
		[2732] = "山脊雌豹",
		[2736] = "巨型石元素",
		[2740] = "暗炉巫师",
		[660] = "血顶巫医",
		[2748] = "阿扎达斯",
		[2550] = "斯蒂沃特船长",
		[645] = "曲奇",
		[2760] = "烈焰流放者",
		[2775] = "刺脊掠夺者",
		[1397] = "霜鬃先知",
		[6035] = "剃刀沼泽捕猎者",
		[2776] = "复仇巨浪",
		[7605] = "拉文",
		[2742] = "暗炉吟唱者",
		[2655] = "绿色淤泥怪",
		[5292] = "深痕雪人",
		[2530] = "未知目标",
		[7106] = "碧火潜行者",
		[7139] = "铁木践踏者",
		[641] = "地精木匠",
		[5622] = "盎格库尔",
		[2757] = "布莱克拉什",
		[636] = "迪菲亚黑衣卫兵",
		[5646] = "沙怒掷斧者",
		[5979] = "悲惨的失落者",
		[634] = "迪菲亚监工",
		[432] = "暗皮蛮兵",
		[7725] = "恐怖图腾袭击者",
		[10940] = "往日的幽灵",
		[2733] = "药剂师乔瑞尔",
		[2729] = "老峭壁山狗",
		[5710] = "预言者迦玛兰",
		[2892] = "石窟先知",
		[7883] = "安德雷·费尔比德",
		[1559] = "穆克拉",
		[7789] = "沙怒智障者",
		[7797] = "卢兹鲁",
		[7805] = "废土暴徒",
		[3450] = "迪菲亚鹦鹉",
		[4860] = "石头管理者",
		[11560] = "玛格拉姆鬼魂",
		[11576] = "旋风撕裂者",
		[7455] = "猫头鹰",
		[7447] = "冰风奇美拉幼兽",
		[38] = "迪菲亚暴徒",
		[5854] = "重型作战傀儡",
		[5862] = "暮光地占师",
		[2462] = "食腐虫",
		[5846] = "黑铁工头",
		[2928] = "远古枭兽",
		[2932] = "马格雷甘·深影",
		[2681] = "邪枝巨狼",
		[568] = "暗皮战士",
		[2944] = "索格伦",
		[11784] = "瑟莱德丝卫士",
		[397] = "莫甘斯",
		[5336] = "憎世巫师",
		[2960] = "喵呜丶嗷",
		[8541] = "憎恨吟唱者",
		[7327] = "枯萎战士",
		[3425] = "豹",
		[11896] = "淤血虫",
		[5304] = "乱羽翼鹿",
		[5296] = "狂暴的怒痕雪人",
		[5288] = "疯狂的长牙狼",
		[5982] = "黑色屠戮者",
		[5990] = "红石蜥蜴",
		[5280] = "噩梦龙族",
		[6006] = "魔誓专家",
		[4458] = "黑腮猎人",
		[8657] = "未知目标 <胡库>",
		[2645] = "邪枝暗影猎手",
		[1188] = "灰斑黑熊",
		[1176] = "坑道鼠征粮官",
		[7857] = "南海码头工人",
		[5224] = "黑暗滑行虫",
		[5617] = "废土暗法师",
		[3261] = "刺背织棘者",
		[7769] = "哈扎里寄生虫",
		[1726] = "迪菲亚法师",
		[8317] = "阿塔莱死亡行者的灵魂 <阿塔莱死亡行者>",
		[12216] = "毒劣魔",
		[8257] = "小软泥怪 <深色软泥怪>",
		[7091] = "暗炉伏击者",
		[6650] = "方弗罗将军",
		[3100] = "笨笨",
		[8179] = "强效治疗结界 <莫什奥格萨满祭司>",
		[1150] = "淡水鳄",
		[4119] = "老风蛇",
		[4127] = "乱齿土狼",
		[2565] = "巨型平原狼蛛",
		[4143] = "馒头",
		[4151] = "盐石水晶蜥蜴",
		[6206] = "洞窟穴居者",
		[10183] = "月焰图腾 <冬泉图腾师>",
		[6222] = "麻疯技师",
		[6230] = "动力保安装甲",
		[36] = "麦田傀儡",
		[5363] = "北泉游荡者",
		[1144] = "莫什奥格巫医",
		[12219] = "尖刺鞭笞者",
		[12203] = "兰斯利德",
		[2630] = "地缚图腾 <黑暗的猫>",
		[2242] = "辛迪加间谍",
		[2727] = "峭壁山狗",
		[6190] = "恶鞭战士",
		[4263] = "深苔幼蛛",
		[8538] = "未知目标",
		[4436] = "剃刀沼泽卫兵",
		[4287] = "血色豪侠",
		[4295] = "血色仆从",
		[4303] = "血色修士",
		[199] = "小碎尸鸟",
		[6366] = "库尔森奴隶",
		[315] = "斯塔文·密斯特曼托",
		[683] = "豹",
		[4343] = "尘泥钳嘴鳄鱼",
		[4351] = "血沼迅猛龙",
		[4359] = "黑鳍鱼人",
		[441] = "未知目标",
		[4854] = "格瑞姆洛克",
		[1251] = "裂拳好战者",
		[4391] = "沼泽软泥怪",
		[7449] = "冰风破坏者",
		[202] = "恐怖骸骨",
		[1795] = "灼热的食尸鬼",
		[938] = "库尔森特种兵",
		[3240] = "雷角蜥蜴",
		[203] = "骷髅法师",
		[8890] = "铁怒狱卒",
		[3260] = "刺背寻水者",
		[3256] = "迅猛龙",
		[6518] = "焦油潜伏者",
		[8600] = "瘟疫蝙蝠",
		[4292] = "血色保卫者",
		[2208] = "灰雾潮行者",
		[6550] = "法力怒灵",
		[4511] = "摇滚硕硕",
		[205] = "夜行黑暗狼人",
		[7157] = "死木复仇者",
		[4535] = "被驯服的斗猪",
		[4324] = "灼热雏龙",
		[3947] = "地精造船师",
		[10928] = "魅魔",
		[5235] = "真菌软泥怪",
		[644] = "拉克佐",
		[9162] = "幼双帆龙",
		[548] = "鱼人小招潮者",
		[4872] = "黑曜石傀儡",
		[206] = "夜行邪齿狼人",
		[1038] = "龙喉暗影守卫",
		[4623] = "野猪人勇士",
		[675] = "风险投资公司工头",
		[1211] = "麻疯侏儒",
		[7356] = "腐烂的普雷莫尔",
		[4655] = "玛洛迪争斗者",
		[210] = "噬骨者",
		[4671] = "怨怒欺诈者",
		[4679] = "地狱魔女",
		[4692] = "恐怖飞扑者",
		[4695] = "恐怖腐化鸟",
		[2923] = "癞皮银鬃狼",
		[2319] = "辛迪加巫师",
		[7321] = "石窟织炎者",
		[212] = "裂拳战士",
		[1199] = "雪豹幼崽",
		[4463] = "黑石召唤师",
		[11561] = "亡灵劫掠者",
		[213] = "饥饿的恐狼",
		[11577] = "旋风雷暴行者",
		[1193] = "洛克湖狂鱼",
		[522] = "摩拉迪姆",
		[2377] = "碎鳍潮行鱼人",
		[3424] = "风蛇",
		[4694] = "食腐鸟",
		[2369] = "刺脊滩行者",
		[215] = "迪菲亚夜行者",
		[4728] = "砂腭蜥蜴",
		[4863] = "玉脊蜥蜴",
		[4847] = "暗炉发掘者",
		[4855] = "石窟争斗者",
		[6910] = "鲁维罗什",
		[11785] = "黄眼蜥蜴",
		[4341] = "尘泥鳄鱼",
		[217] = "结网毒蜘蛛",
		[3472] = "风蛇",
		[2651] = "枯木剥皮者",
		[4696] = "荒土巨钳蝎",
		[218] = "盗墓者",
		[6170] = "加特斯比尔",
		[8602] = "巨型瘟疫蝙蝠",
		[4672] = "怨怒魔仆",
		[2333] = "仆从瓦里克",
		[1052] = "黑铁破坏者",
		[10946] = "掠夺者霍古斯",
		[7022] = "毒鞭蝎",
		[7030] = "暗炉地质学家",
		[7038] = "索瑞森密探",
		[5451] = "哈扎里群居蝎",
		[3] = "食腐者",
		[11291] = "不死的烂苔巨魔",
		[9454] = "萨瓦瑟拉斯",
		[7078] = "裂隙沙漠蝎",
		[7086] = "被诅咒的软泥怪",
		[8525] = "天灾看守",
		[5286] = "长牙奔跑者",
		[7110] = "碧火捕猎者",
		[7118] = "加德纳尔暗法师",
		[7126] = "加德纳尔猎犬",
		[12217] = "腐化劣魔",
		[7977] = "加莫里塔",
		[680] = "莫什奥格领主",
		[7158] = "死木萨满祭司",
		[2649] = "枯木割颅者",
		[13601] = "工匠吉兹洛克",
		[639] = "艾德温·范克里夫",
		[1084] = "小盐齿鳄鱼",
		[2653] = "枯木虐待者",
		[7206] = "古代的石头看守者",
		[565] = "疯狂的恐狼",
		[6575] = "血色预备兵",
		[4520] = "剃刀沼泽地占师",
		[6559] = "粘稠的软泥怪",
		[7246] = "沙怒暗影猎手",
		[6551] = "格里什异种蝎",
		[531] = "骸骨魔",
		[1123] = "霜鬃猎头者",
		[6527] = "焦油爬行者",
		[7286] = "未知目标",
		[5247] = "祖卡什掘洞蝎",
		[5255] = "木爪劫掠者",
		[5263] = "阿塔莱木乃伊",
		[5271] = "阿塔莱死亡行者",
		[6519] = "焦油兽王",
		[7334] = "恐怖战斗野猪",
		[5295] = "暴怒的深痕雪人",
		[1117] = "石腭断骨者",
		[7358] = "寒冰之王亚门纳尔",
		[7366] = "石肤图腾 IV <用斧头的萨满>",
		[685] = "荆棘谷迅猛龙",
		[5335] = "憎世尖啸者",
		[10120] = "宝库护卫者",
		[1111] = "吸血捕猎者",
		[5359] = "被缩小的海岸巨人",
		[7414] = "法力之泉图腾 II <公牛的奶>",
		[7115] = "加德纳尔精兵",
		[2924] = "银鬃狼",
		[7438] = "冬泉巨熊怪",
		[12922] = "小鬼爪牙",
		[7454] = "狂暴枭兽",
		[9026] = "未知目标",
		[5423] = "沙漠鞭尾蝎",
		[12201] = "瑟莱德丝公主",
		[3727] = "暗滩执行者",
		[4500] = "莫格穆洛克大王",
		[5455] = "森提帕尔异种蝎",
		[4331] = "火鬃灰尾龙人",
		[5471] = "砂槌食人魔",
		[1124] = "未知目标",
		[7153] = "死木战士",
		[2177] = "挣扎的贵族",
		[4344] = "尘泥杂斑鳄鱼",
		[4512] = "碧玉挽歌",
		[2715] = "火烟蛮兵",
		[1081] = "泥沼之王",
		[4539] = "巨型沼泽蝙蝠",
		[2254] = "破碎岭虐待者",
		[4296] = "血色老兵",
		[7606] = "欧罗·血眼",
		[2570] = "石拳萨满祭司",
		[9777] = "灵焰小鬼",
		[589] = "迪菲亚抢劫者",
		[3820] = "野棘毒蜘蛛",
		[3824] = "幽爪嗥叫者",
		[9163] = "双帆龙",
		[5615] = "废土游荡者",
		[5623] = "废土刺客",
		[7397] = "土灵凿石者",
		[11290] = "烂苔僵尸",
		[5647] = "沙怒猎头者",
		[679] = "莫什奥格萨满祭司",
		[3560] = "治疗结界 <枯木巫医>",
		[7342] = "骷髅召唤者",
		[7726] = "恐怖图腾博学者",
		[822] = "森林熊幼崽",
		[8956] = "怒爪熊",
		[4285] = "血色追随者",
		[5711] = "可悲的奥戈姆",
		[5719] = "摩弗拉斯",
		[12046] = "掠夺者格玛洛克",
		[1082] = "盐齿鳄鱼",
		[7349] = "墓穴魔",
		[6223] = "麻疯防御者",
		[3904] = "灼热图腾 IV",
		[7273] = "加兹瑞拉",
		[3912] = "石爪图腾 III <黑暗的猫>",
		[6207] = "洞窟伏击者",
		[11578] = "旋风切割者",
		[7846] = "吞噬者特雷姆斯",
		[5807] = "豹",
		[7329] = "枯萎野猪人守卫",
		[5239] = "戈杜尼大法师",
		[5243] = "被诅咒的阿塔莱巨魔",
		[5839] = "黑铁地质学家",
		[7079] = "粘性辐射尘",
		[5855] = "熔岩元素",
		[1031] = "红色软泥怪",
		[9691] = "毒尖蝎",
		[1138] = "雪狼",
		[4467] = "邪枝占卜者",
		[11786] = "黄眼掠夺者",
		[3976] = "血色十字军指挥官莫格莱尼",
		[5459] = "森提帕尔掘洞蝎",
		[7341] = "骷髅冰霜法师",
		[3988] = "风险投资公司操作员",
		[11685] = "玛洛迪祭司",
		[4727] = "老迈的雷霆蜥蜴",
		[8158] = "布隆克",
		[520] = "布拉克",
		[1022] = "杂斑镰爪龙",
		[3415] = "豹",
		[1054] = "黑铁爆破手",
		[5991] = "红石晶鳞蜥蜴",
		[4028] = "烧焦的树人",
		[6007] = "魔誓执行者",
		[7345] = "碎骨统帅",
		[4036] = "游荡的焰灵",
		[4040] = "洞穴捕猎者",
		[4044] = "黑色石化蜥蜴",
		[588] = "血顶斥候",
		[7333] = "枯萎战斗野猪",
		[1121] = "霜鬃雪行者",
		[4140] = "恐蝎劫掠者",
		[4064] = "黑石斥候",
		[7170] = "斯拉格姆",
		[8876] = "沙怒侍僧",
		[1042] = "红色雏龙",
		[12218] = "邪恶幼虫",
		[6111] = "火焰新星图腾 II <石窟萨满祭司>",
		[7209] = "未知目标 <黑曜石哨兵>",
		[7405] = "致命的裂隙沙漠蝎",
		[1025] = "蓝腮污水鱼人",
		[1027] = "蓝腮战士",
		[863] = "斯通纳德猎人",
		[4120] = "雷鸣岩石元素",
		[4128] = "乱齿捕猎者",
		[1035] = "龙喉沼泽行者",
		[4844] = "暗炉勘探员",
		[1039] = "沼泽定居者",
		[1041] = "沼泽之王",
		[1043] = "迷路的雏龙",
		[2089] = "巨型湿地鳄鱼",
		[6231] = "尖端机器人",
		[6239] = "塞克隆尼亚",
		[1051] = "黑铁矮人",
		[1053] = "黑铁隧道工",
		[5287] = "长牙嚎叫者",
		[1057] = "龙喉白骨守卫",
		[1059] = "残忍的安纳希克",
		[1061] = "甘祖拉恩",
		[4248] = "杂毛土狼",
		[4440] = "剃刀沼泽图腾师",
		[5237] = "戈杜尼食人魔法师",
		[7337] = "亡首通灵师",
		[4280] = "血色医师",
		[4288] = "血色驯兽员",
		[2149] = "黑铁袭击者",
		[4304] = "血色捕猎犬",
		[1023] = "杂斑刺喉龙",
		[8636] = "守护者莫塔加亚",
		[1083] = "鱼人巡滩者",
		[1085] = "老年荆棘谷猛虎",
		[1087] = "盐齿钳嘴鳄",
		[4352] = "血沼尖啸龙",
		[4360] = "黑鳍战士",
		[2185] = "黑海岸蛇颈龙",
		[4376] = "黑雾蜘蛛",
		[1097] = "风险投资公司技工",
		[4392] = "腐蚀性的沼泽软泥怪",
		[6218] = "辐射泥浆怪",
		[2205] = "灰雾战士",
		[4416] = "迪菲亚赤膊矿工",
		[4424] = "阿格姆",
		[1109] = "碎尸鸟",
		[6487] = "奥法师杜安",
		[429] = "暗皮巫师",
		[1115] = "石腭击颅者",
		[4464] = "黑石角斗士",
		[2237] = "月夜雄虎",
		[2241] = "辛迪加窃贼",
		[2245] = "辛迪加破坏者",
		[2249] = "凶恶的雪人",
		[2253] = "破碎岭蛮兵",
		[2257] = "玛格索尔",
		[1131] = "冬狼",
		[4528] = "石行者 <未知目标>",
		[2261] = "辛迪加卫士",
		[1032] = "黑色软泥怪",
		[285] = "鱼人",
		[525] = "癞皮狼",
		[0] = "紫色蘑菇疾病",
		[2349] = "巨型食苔蛛",
		[9164] = "老双帆龙",
		[6234] = "机械守护者",
		[1151] = "海鳄",
		[3099] = "战略储备粮",
		[518] = "犹勒",
		[1157] = "被诅咒的水手",
		[1159] = "大副斯涅利格",
		[1161] = "碎石穴居人",
		[1163] = "碎石怪击颅者",
		[1165] = "碎石怪地卜师",
		[1167] = "碎石怪掘地工",
		[1169] = "黑铁叛军",
		[4680] = "末日看守队长",
		[3127] = "可爱小蝎子",
		[1175] = "坑道鼠掘地工",
		[1128] = "黑熊幼崽",
		[1179] = "莫格罗什执行者",
		[1181] = "莫格罗什萨满祭司",
		[1183] = "莫格罗什秘法师",
		[1185] = "林木潜伏者",
		[2373] = "未知目标",
		[1189] = "黑熊首领",
		[6523] = "黑铁火枪手",
		[2385] = "豹",
		[1195] = "森林潜伏者",
		[1197] = "碎石怪萨满祭司",
		[300] = "扎克乌尔",
		[1201] = "雪豹",
		[2405] = "塔伦米尔亡灵卫兵",
		[1205] = "格劳姆格",
		[1207] = "布劳勒尔",
		[2417] = "守财奴格雷尔伯格",
		[2421] = "玛克拉克",
		[4848] = "暗炉暗法师",
		[4856] = "石窟猎手",
		[2433] = "赫尔库拉的遗骸",
		[11787] = "岩孔虫",
		[12759] = "泰德雷斯",
		[2102] = "龙喉步兵",
		[1225] = "奥尔苏迪",
		[5460] = "森提帕尔沙行者",
		[1122] = "霜鬃剥皮者",
		[3243] = "豹",
		[5299] = "残忍的怒痕雪人",
		[7155] = "死木探险者",
		[7357] = "火眼莫德雷斯",
		[2477] = "格拉多克",
		[9916] = "加奎亚",
		[5331] = "憎世战士",
		[7023] = "黑曜石哨兵",
		[11789] = "深岩虫",
		[7039] = "战争掠夺者",
		[7047] = "黑色小龙",
		[2505] = "方恨少",
		[314] = "伊莉莎",
		[1108] = "迷雾谷猩猩",
		[1259] = "高布勒尔",
		[2521] = "蓝鬃猩猩",
		[5475] = "砂槌术士",
		[3255] = "迅猛龙",
		[7111] = "碧火唤魔者",
		[2537] = "拇指苏克",
		[2541] = "萨克拉希斯",
		[2545] = "帅小伙子邓肯",
		[2549] = "加尔·盐蹄",
		[2553] = "枯木暗影法师",
		[2557] = "枯木暗影猎手",
		[2561] = "高地猎兽龙",
		[7175] = "石窟伏击者",
		[2569] = "石拳虐待者",
		[2573] = "枯须勘探员",
		[2577] = "黑铁暗法师",
		[580] = "赤脊山苦工",
		[1160] = "哈林多尔船长",
		[2589] = "辛迪加雇佣兵",
		[5184] = "塞拉摩哨兵",
		[2597] = "法库雷斯特公爵",
		[7247] = "沙怒噬魂者",
		[5229] = "戈杜尼食人魔",
		[2318] = "暗影大法师",
		[7271] = "巫医祖穆拉恩",
		[5232] = "戈杜尼蛮兵",
		[5240] = "戈杜尼术士",
		[1206] = "纳什尔",
		[5256] = "阿塔莱战士",
		[8477] = "骷髅仆从 <亡首通灵师>",
		[5272] = "铁鬃灰熊",
		[2641] = "邪枝猎头者",
		[7335] = "亡首地卜师",
		[7343] = "碎骨骷髅",
		[7351] = "墓穴劫掠者",
		[8529] = "天灾勇士",
		[2619] = "落锤步兵",
		[2434] = "暗影刺客",
		[334] = "加塞尔佐格",
		[8637] = "黑铁巡逻兵",
		[335] = "森格",
		[5360] = "被缩小的深海巨人",
		[7415] = "法力之泉图腾 III",
		[10916] = "冬泉信使",
		[12223] = "洞窟潜伏者",
		[7439] = "冬泉萨满祭司",
		[2701] = "火烟食人魔",
		[1353] = "萨尔图斯",
		[624] = "亡灵挖掘者",
		[5424] = "沙漠疾行蝎",
		[2717] = "火烟虐待者",
		[2721] = "被遗忘者保镖",
		[2725] = "滚烫的雏龙",
		[5456] = "森提帕尔毒刺蝎",
		[8877] = "沙怒狂热者",
		[5472] = "砂槌执行者",
		[4300] = "血色巫师",
		[2745] = "因弗努斯大使",
		[2534] = "流亡者赞吉尔",
		[8957] = "怒爪灰熊",
		[345] = "贝利格拉布",
		[2761] = "水浪流放者",
		[2566] = "石拳蛮兵",
		[4026] = "血怒唤风者",
		[8961] = "魔爪掠夺者",
		[647] = "绿皮队长",
		[2926] = "银鬃捕猎者",
		[1393] = "狂暴穴居人",
		[1563] = "血帆流氓",
		[2793] = "考格雷什",
		[5228] = "深色软泥怪",
		[2618] = "落锤苦工",
		[8437] = "哈卡莱爪牙",
		[5616] = "废土窃贼",
		[9297] = "暴怒的飞龙",
		[8543] = "缝合憎恶",
		[13323] = "地下双帆龙",
		[5648] = "沙怒暗影法师",
		[2829] = "饥饿的秃鹫",
		[1417] = "湿地鳄鱼幼崽",
		[682] = "荆棘谷猛虎",
		[7727] = "恐怖图腾萨满祭司",
		[687] = "丛林捕猎者",
		[691] = "次级水元素",
		[671] = "血顶猎头者",
		[5712] = "祖罗",
		[5720] = "德拉维沃尔",
		[7995] = "邪恶祭司海克斯",
		[7768] = "枯木血虫",
		[9695] = "死鞭蝎",
		[5268] = "铁鬃熊",
		[11516] = "木喉游荡者",
		[5043] = "迪菲亚暴徒",
		[8607] = "腐烂淤泥怪",
		[2893] = "石窟断骨者",
		[4697] = "荒土鞭尾蝎",
		[7847] = "卡利夫·斯科比斯汀",
		[7855] = "南海海盗",
		[2739] = "未知目标",
		[740] = "翠绿幼龙",
		[735] = "鱼人士兵",
		[5840] = "黑铁锻造师",
		[2925] = "银鬃嗥狼",
		[5856] = "晶网蜘蛛",
		[7344] = "碎骨战士",
		[2937] = "贪婪的达古恩",
		[766] = "纠缠恐兽",
		[2945] = "莫达洛克",
		[11788] = "岩石虫",
		[5300] = "乱羽角鹰兽",
		[2992] = "治疗结界 V <失落者先知>",
		[446] = "赤脊山猛击者",
		[5225] = "黑暗粘液虫",
		[6211] = "洞窟劫掠者",
		[1487] = "裂拳奴役者",
		[1489] = "赞吉尔猎人",
		[1491] = "赞吉尔纳迦",
		[2260] = "辛迪加潜行者",
		[7268] = "沙怒守护者",
		[5984] = "饥饿的弯牙土狼",
		[5992] = "未知目标",
		[703] = "范高雷中尉",
		[7107] = "碧火欺诈者",
		[6016] = "防护元素图腾 <亡首圣贤>",
		[7796] = "耐克鲁姆",
		[5988] = "厚甲毒刺蝎",
		[1511] = "暴怒的银背猩猩",
		[8095] = "苏利萨斯沙行者",
		[4411] = "暗牙潜伏者",
		[486] = "萨瑞尔祖恩",
		[5293] = "暴怒的巨型深痕雪人",
		[8127] = "安图苏尔",
		[2251] = "巨型雪人",
		[428] = "恐鹫",
		[11794] = "塞雷布拉斯的姐妹",
		[12220] = "蟒藤",
		[1010] = "藓皮沼泽行者",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		2, -- [1]
		3, -- [2]
		[0] = 2,
		["法术反制"] = 8,
		["神圣净化"] = 8,
		["致盲"] = 4,
		["护甲"] = 5,
		["酸液喷射"] = "噩梦龙族",
		["酸息术"] = "德姆塞卡尔",
		["恢复"] = 5,
		["愈合"] = 11,
		[6150] = 3,
		["十字军圣印"] = 2,
		["深度沉睡"] = "伊兰尼库斯的阴影",
		[1032] = 2,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		["灰尘力场"] = "瑟莱德丝公主",
		[5171] = 4,
		[19709] = 2,
		["荆棘术"] = 8,
		["喝水"] = 2,
		["感知"] = 4,
		[5215] = 11,
		["闪光炸弹"] = "工匠吉兹洛克",
		["清洁术"] = 2,
		["毒害之灾"] = "腐化劣魔",
		[7301] = 8,
		["雷霆一击"] = 1,
		[11549] = 1,
		["嗜血"] = 1,
		["冰雹"] = "机械冰霜行者",
		["灵猴守护"] = 3,
		["鞭根块茎"] = 4,
		[1075] = 11,
		["冰链术"] = "亡首专家",
		["闪电吐息"] = "小布丁 <全弹发射>",
		[17] = 5,
		[11733] = 9,
		["斧类武器投掷"] = "地精木匠",
		["烈焰风暴"] = 8,
		["切割"] = 4,
		[13819] = 2,
		["出血"] = 4,
		["音素爆破"] = "巨型沼泽蝙蝠",
		["献祭陷阱"] = 3,
		["奥术冲击"] = 2,
		["黑暗祭品"] = "沙怒噬魂者",
		["挥砍"] = "乌克兹·沙顶",
		["自毁"] = "石头看守者",
		[139] = 5,
		[19742] = 2,
		["低吼"] = 1,
		["冬泉火酒"] = 2,
		["制造魔法玛瑙"] = 8,
		["吸取灵魂"] = 9,
		[5487] = 11,
		["冰霜射击"] = "剃刀沼泽驯兽师",
		["黑曜石破碎"] = "黑曜石哨兵",
		["疾病射击"] = "枯萎矛鬃野猪人",
		[3267] = 2,
		["斩杀"] = 1,
		[1127] = 8,
		["压制"] = 1,
		[1133] = 8,
		[1135] = 9,
		["冰冻"] = 8,
		["毒性震击"] = "爬行污泥怪",
		["毒性钉刺"] = "毒鞭蝎",
		["寒冰护体"] = 8,
		["召唤阿塔莱死亡行者的灵魂"] = "阿塔莱死亡行者",
		["枪械射击"] = 4,
		["死亡缠绕"] = 9,
		["毒性箭雨"] = "诺克赛恩",
		["打击"] = "迪克斯特·瓦德",
		["闪避"] = 4,
		["恢复法力"] = 5,
		[588] = 5,
		["召唤军马"] = 2,
		["无情打击效果"] = 4,
		["包围之风"] = "剃刀沼泽织尘者",
		[592] = 5,
		["水流喷射"] = "塞萨拉多头怪",
		["防护火焰结界"] = 8,
		["寒冰屏障"] = 8,
		["脚踢"] = 4,
		["热疫"] = "殉教者塞卡",
		["毒蛇钉刺"] = 3,
		["导致疯狂"] = "哈卡的化身",
		["鬼魅攻击"] = 4,
		["折磨"] = "萨塔斯特 <Leto>",
		[600] = 5,
		["魔法吸收"] = 8,
		["强化震荡射击"] = 3,
		["召唤虚空行者"] = 9,
		["复活宠物"] = 3,
		["智慧圣印"] = 2,
		[604] = 8,
		["血之狂热"] = 1,
		["制造块茎"] = "地鼠 <海豹>",
		["命令圣印"] = 2,
		["吸取法力"] = 9,
		["潜伏"] = "豹 <射雕英雄传>",
		["圣洁光环"] = 2,
		["腐烂恶臭"] = "腐烂的普雷莫尔",
		["水晶沉睡"] = "玉脊蜥蜴",
		["丝绸卷"] = 9,
		["安图苏尔的爪牙"] = "安图苏尔",
		["急奔"] = 11,
		["放逐术"] = 9,
		["上钩拳"] = "诺克赛恩",
		["精神鞭笞"] = 5,
		["吞噬魔法"] = "苏霍姆 <Edge>",
		["熔铁之水"] = "基尔尼格",
		["破甲攻击"] = 1,
		["孢子之云"] = "孢子树",
		[1244] = 5,
		[1245] = 5,
		["生命回复"] = 1,
		["变形术"] = 8,
		["保护祝福"] = 2,
		["图特卡什的诅咒"] = "图特卡什",
		["Warder Despawn"] = "安图苏尔",
		["栗色马"] = 8,
		["神圣之灵"] = 5,
		["幼虫粘液"] = "邪恶幼虫",
		["闪电箭"] = "剃刀沼泽地占师",
		["刺破"] = "锐刺鞭笞者",
		["召唤阿塔莱骷髅"] = "阿塔莱高阶祭司",
		["击倒"] = "洞窟潜伏者",
		[8113] = 2,
		["猛击"] = 1,
		[13165] = 3,
		["雄鹰守护"] = 3,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["毒药"] = "墓穴魔",
		["专注光环"] = 2,
		["冰霜抗性光环"] = 2,
		["圣佑术"] = 2,
		["守护之刺"] = 3,
		["法力护盾"] = 8,
		["枯萎之触"] = "枯萎野猪人守卫",
		["白山羊"] = 1,
		["炽热火焰"] = 2,
		["旋风倾泻"] = "剃刀沼泽刺鬃守卫",
		["火焰新星图腾"] = "安图苏尔",
		[11327] = 4,
		["力量"] = 2,
		["敏捷"] = 1,
		["地狱火罩"] = "石窟织炎者",
		["生命虹吸"] = 9,
		["进食"] = 2,
		["召唤野猪之魂"] = "阿格姆",
		["法力燃烧"] = "亡首侍僧",
		["救赎"] = 2,
		["战斗怒吼"] = 1,
		["灼热之痛"] = 9,
		["驱散魔法"] = 5,
		["冲锋击昏"] = 1,
		[7302] = 8,
		["猎豹守护"] = 3,
		["致命毒药"] = "石窟潜伏者",
		["大地震颤"] = "剃刀沼泽震地者",
		["盾牌猛击"] = "卡姆·深怒",
		["毒云术"] = 4,
		["胡库的卫士"] = "胡库",
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["横扫攻击"] = 1,
		["心灵震颤"] = "剃刀沼泽裂地者",
		["恶魔学识大师"] = 9,
		["乱舞"] = 1,
		[20289] = 2,
		["残废术"] = "亡首通灵师",
		["烈焰喷射"] = "机械烈焰行者",
		["毒蝎钉刺"] = 3,
		[18371] = 9,
		[673] = 5,
		["偷袭"] = 4,
		["刺穿护甲"] = "噩梦游荡者",
		["召唤冰霜亡魂"] = "寒冰之王亚门纳尔",
		["智慧祝福"] = 2,
		["毒性鱼叉"] = "绿皮队长",
		["阿塔莱骷髅图腾"] = "祖罗",
		["制造魔法黄水晶"] = 8,
		["闪现术"] = 8,
		["制造灵魂石"] = 9,
		[19746] = 2,
		["恐惧嚎叫"] = 9,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["紫色蘑菇疾病"] = "Magenta Cap Clusters Trap",
		[8938] = 11,
		["制造维格利的酒桶"] = "维格利",
		["剧痛鞭笞"] = "布雷维恩 <Edge>",
		["疾跑"] = 4,
		["辐射之毒"] = 11,
		["盾牌专精"] = 1,
		["治疗石"] = 9,
		[14149] = 4,
		["冰霜陷阱"] = 3,
		["龙息红椒"] = 1,
		[20162] = 2,
		["心灵尖啸"] = 5,
		["火焰新星"] = "火眼莫德雷斯",
		["召唤黑曜石碎片"] = "黑曜石哨兵",
		["暴风雪"] = 8,
		["进食充足"] = 3,
		["冰甲术"] = 8,
		[706] = 9,
		["战斗姿态"] = 1,
		["火焰强化"] = 9,
		["召唤地狱战马"] = 9,
		["狂野怒火"] = 3,
		["投石"] = "原始巨兽",
		["惩戒痛击"] = 1,
		["灵魂撕咬"] = "沙怒噬魂者",
		["致命毒药 III"] = 4,
		["月火术"] = 11,
		["节能施法"] = 8,
		["神圣干涉"] = 2,
		["侦测魔法"] = 8,
		["耐力提高"] = 2,
		["召唤宠物"] = 3,
		["吸血鬼的拥抱"] = 5,
		["火焰抗性光环"] = 2,
		["奉献"] = 2,
		["凶猛撕咬"] = 11,
		["土灵卫士被摧毁"] = "土灵筑厅师",
		["暗影之盾"] = "阿塔莱高阶祭司",
		[20131] = 2,
		["丝瓜"] = 4,
		[1459] = 8,
		["憎恨怒视"] = "瑟莱德丝公主",
		["Activate Bomb 02"] = "麦克尼尔·瑟玛普拉格",
		["畏缩"] = "清补凉 <全弹发射>",
		["暗影形态"] = 5,
		["群体清除"] = "施法者克星X-21",
		["奥法药剂"] = 8,
		["十字军审判"] = 2,
		["耐力"] = 2,
		["防护元素图腾"] = "亡首圣贤",
		["献祭"] = 9,
		["秘银盾刺"] = 2,
		["厚魔纹绷带"] = 9,
		["奥术射击"] = 3,
		["Activate Bomb 01"] = "麦克尼尔·瑟玛普拉格",
		["Fire"] = "环境伤害 (火烧)",
		["乱射"] = 3,
		["变异鱼大餐"] = 1,
		["攻击"] = 2,
		["驱邪术"] = 2,
		["战争践踏"] = "艾隆纳亚",
		["妖术"] = "沙怒暗影猎手",
		[20915] = 2,
		["巨石之力"] = 2,
		["生命 II"] = 2,
		["穿刺射击"] = "迪菲亚工头",
		["逃脱"] = 3,
		["盾牌壁垒"] = 2,
		["精神祷言"] = 5,
		["摔绊"] = 3,
		["力量祝福"] = 2,
		["黑马"] = 4,
		["冰霜箭"] = 3,
		[20132] = 2,
		["纯净术"] = 2,
		["!Melee"] = 1,
		["补充法力 II"] = 8,
		["回春术"] = 11,
		["狂暴回复"] = 11,
		[768] = 11,
		[14318] = 3,
		["盾刺"] = "洛若尔",
		["飓风"] = 11,
		[10298] = 2,
		["冰霜陷阱光环"] = 3,
		[6192] = 1,
		["荆棘箭雨"] = "尖刺鞭笞者",
		["公正圣印"] = 2,
		["寒冰箭"] = 8,
		["强效治疗术"] = 5,
		["治疗药水"] = 2,
		["自动射击"] = 3,
		[5229] = 11,
		["新近包扎"] = 8,
		["真言术：盾"] = 5,
		["坚定信念"] = 2,
		["召唤地行者"] = "鲁古格",
		["条纹夜刃豹"] = 4,
		["反手一击"] = "迪菲亚罪犯",
		["精神矍铄"] = 2,
		["安图苏尔的治疗波"] = "安图苏尔",
		["急速冲锋"] = "被驯服的斗猪",
		[5277] = 4,
		[1463] = 8,
		["自然之握"] = 11,
		["投网"] = "动力保安装甲",
		[6074] = 5,
		[20133] = 2,
		["防护恐惧结界"] = 5,
		["牺牲"] = 9,
		["顺劈斩"] = "地精木匠",
		["法力回复"] = 8,
		["拦截昏迷"] = 1,
		["铁皮手雷"] = 4,
		[696] = 9,
		["割裂"] = 4,
		["搜索"] = 4,
		[1461] = 8,
		["血性狂暴"] = 1,
		["圣光审判"] = 1,
		[8096] = 8,
		["投掷"] = 4,
		["恶性毒药"] = "墓穴劫掠者",
		["重拳猛击"] = "重拳先生",
		["召唤暗影法师"] = "骷髅召唤者",
		["智力"] = 2,
		["疾病之云"] = "暴食者",
		[20580] = 11,
		["烈焰鞭笞"] = "暗炉地质学家",
		["清算"] = 9,
		["霜寒刺骨"] = 8,
		["圆弧斩"] = "洞窟劫掠者",
		[29131] = 1,
		["连发寒冰箭"] = "哈卡莱霜翼飞蛇",
		["冲击"] = 8,
		["创造占卜之碗"] = 5,
		["深冬之寒"] = 8,
		["火焰之雨"] = 9,
		["生命分流"] = 9,
		["元素大师"] = 8,
		["次级治疗石"] = 9,
		["黑铁地雷"] = "黑铁密探",
		["进食充分"] = 2,
		["假死"] = 3,
		["活化烈焰"] = "活火",
		["劣质炸药"] = 8,
		["点燃"] = 8,
		["相位变换"] = "未知目标 <Edge>",
		["正义之怒"] = 2,
		["毒液箭"] = "毒劣魔",
		["突进"] = "未知目标 <人民币窝>",
		["召唤诺克赛恩产物"] = "诺克赛恩",
		["潜行"] = 11,
		["火焰之盾效果 IV"] = "石窟织炎者",
		[6075] = 5,
		["致死打击"] = 1,
		["统御意志"] = "亡语者贾格巴",
		["刺耳怒吼"] = 1,
		["挫志怒吼"] = 1,
		["熊形态"] = 11,
		["狂怒之嚎"] = 3,
		["痛击"] = "重拳先生",
		["旅行形态"] = 11,
		["尖啸"] = "清补凉 <全弹发射>",
		["绝望祷言"] = 5,
		["野性印记"] = 11,
		["心灵专注"] = 5,
		["野性回复"] = "洞窟游荡者",
		["毒性射击"] = "剃刀沼泽兽王",
		["解除次级诅咒"] = 8,
		["条纹霜刃豹"] = 5,
		[20134] = 2,
		["腐坏之血"] = "苏霍姆 <Edge>",
		["堕落自然之力"] = "被诅咒的塞雷布拉斯",
		[3747] = 5,
		["催眠术"] = "噩梦龙族",
		[5232] = 11,
		["诱惑"] = "布雷维恩 <Edge>",
		["狂怒"] = "可怕的塔格尔",
		["扫击"] = "寻找回忆",
		["破釜沉舟"] = 1,
		["启发"] = 2,
		["挥击"] = 11,
		["暗影箭雨"] = "暗炉暗法师",
		["召唤骷髅仆从"] = "亡首通灵师",
		["撒网"] = "图特卡什",
		["酸液溅射"] = "曲奇",
		["冲动"] = 4,
		["次级治疗术"] = 5,
		["正义圣印"] = 2,
		[14319] = 3,
		["扰乱射击"] = 3,
		["猎人印记"] = 3,
		["蓝色机械陆行鸟"] = 4,
		["减速术"] = "亡首地卜师",
		["致残毒药"] = 4,
		["烈性炸药"] = 1,
		["守护效果"] = 2,
		["红色机械陆行鸟"] = 8,
		[10299] = 2,
		["闪电之盾"] = "石窟智者",
		["智慧审判"] = 2,
		["冲击波"] = 8,
		["治疗术"] = 5,
		["快速射击"] = 3,
		["暗影箭"] = 9,
		["棕马"] = 1,
		["驱除疾病"] = 5,
		["制造治疗石"] = 9,
		["强化格挡"] = "剃刀沼泽防御者",
		["拯救祝福"] = 2,
		["吸取生命"] = 9,
		[11426] = 8,
		["缩小"] = "格瑞姆洛克",
		["飞扑"] = "哈卡莱霜翼飞蛇",
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["烈焰震击"] = "加加恩·火锤",
		["挑战咆哮"] = 11,
		["火焰增效"] = "加加恩·火锤",
		[20918] = 2,
		["伤害增效"] = "骷髅暗影法师 <骷髅召唤者>",
		["指挥地鼠"] = 1,
		["魔爆术"] = 8,
		["佯攻"] = 4,
		["原始狂怒"] = 11,
		["神圣震击"] = 2,
		["次级隐形术"] = "布雷维恩 <Edge>",
		["补充营养"] = 3,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["心灵震爆"] = 5,
		[7294] = 2,
		["爪击"] = 11,
		["烈焰尖刺"] = "亡首地卜师",
		["剑刃乱舞"] = 4,
		["石像形态"] = 1,
		["治疗祷言"] = 5,
		["血袭"] = 11,
		["嗜血术"] = "哈姆霍克",
		["魔法增效"] = 8,
		["突袭"] = 11,
		["强效治疗石"] = 9,
		["杂色马"] = 4,
		["暗影灼烧"] = 9,
		["自律"] = 2,
		[431] = 8,
		["拳击"] = 1,
		["正义审判"] = 2,
		[20375] = 2,
		[432] = 9,
		["安抚心灵"] = 5,
		["加兹瑞拉猛击"] = "加兹瑞拉",
		["冰锥术"] = 8,
		["暗影抗性光环"] = 2,
		["恶魔皮肤"] = "沙怒暗影法师",
		["能量灌注"] = 5,
		["亚门纳尔之怒"] = "寒冰之王亚门纳尔",
		["召唤小软泥怪"] = "深色软泥怪",
		["敏捷提高"] = 3,
		["斑点霜刃豹"] = 11,
		["鲁莽诅咒"] = 9,
		[435] = 8,
		["镇压"] = "噩梦镇压者",
		["挑战怒吼"] = 1,
		["血之诅咒"] = "阿迦玛甘之血",
		["宁静"] = 11,
		["Activate Bomb 04"] = "麦克尼尔·瑟玛普拉格",
		["猛虎之怒"] = 11,
		["狂暴姿态"] = 1,
		["反击风暴"] = 1,
		["诅咒之血"] = "腐烂的阿迦玛",
		["火焰之盾效果 III"] = "血色招魂师",
		["兽群领袖"] = 11,
		["感知亡灵"] = 2,
		["召唤地鼠"] = 5,
		["地精龙枪"] = "工匠吉兹洛克",
		[1044] = 2,
		["扰乱"] = 4,
		["巨熊形态"] = 11,
		["消失"] = 4,
		["炎爆术"] = 8,
		["重击"] = 11,
		["撕扯"] = 11,
		["拉克佐猛击"] = "拉克佐",
		["虫群"] = 11,
		["急速冷却"] = 8,
		["闪电链"] = "哈姆霍克",
		["伏击"] = 4,
		[5006] = 2,
		["惩击"] = 5,
		["奥术智慧"] = 8,
		["治疗宠物"] = 3,
		[8091] = 8,
		["疲劳诅咒"] = 9,
		["地精暗雷"] = "维格利",
		["腐蚀术"] = 9,
		["僵化"] = "苏利萨斯沙行者",
		["惩罚光环"] = 2,
		[8115] = 8,
		["渐隐术"] = 5,
		["唤醒"] = 8,
		[7128] = 5,
		["烟雾弹"] = "巴基尔·斯瑞德",
		["精神错乱"] = 1,
		["火焰冲击"] = 8,
		["坚韧祷言"] = 5,
		["辐射之云"] = "辐射泥浆怪",
		["冰霜凝固"] = "加兹瑞拉",
		["唤醒地灵宝库守卫"] = "阿扎达斯",
		["治疗藤蔓"] = 8,
		["困兽之爪"] = "噬棘食尸鬼",
		["瞄准射击"] = 3,
		["急救"] = 8,
		["冰冻陷阱效果"] = 3,
		["纠缠根须"] = 11,
		[2565] = 1,
		["旋风斩"] = 1,
		["沉默"] = "奥法师杜安",
		["防护暗影结界"] = 9,
		["王者祝福"] = 2,
		["熔化矿石"] = "地精工匠",
		["冲锋"] = 1,
		["昏迷"] = 2,
		["制造初级灵魂石"] = 9,
		["恐惧术"] = 9,
		["拍翼"] = "哈卡莱挖掘者",
		["防御姿态"] = 1,
		["水栖形态"] = 11,
		["邪恶攻击"] = 4,
		["法术封锁"] = "苏霍姆 <Edge>",
		["重伤"] = 1,
		["弓射击"] = 1,
		["恶魔支配"] = 9,
		["激活"] = 11,
		["复仇"] = 1,
		["盾击"] = 1,
		["圣盾术"] = 2,
		["绞喉"] = 4,
		["献祭陷阱效果"] = 3,
		["快速治疗"] = 5,
		["炸弹"] = "维格利",
		["游荡瘟疫"] = 2,
		["击退"] = "麦克尼尔·瑟玛普拉格",
		["侦测次级隐形"] = 9,
		["践踏"] = "石头看守者",
		[5234] = 11,
		["召唤小鬼"] = 9,
		[5242] = 1,
		["厚皮"] = 3,
		["还击"] = 4,
		[7300] = 8,
		["暴怒"] = 1,
		["暗影易伤"] = 5,
		["奥术气泡"] = "奥法师杜安",
		["恢复生命"] = 9,
		["感染之伤"] = "迪菲亚俘虏",
		["自由祝福"] = 2,
		["毒液喷吐"] = "黑暗粘液虫",
		["熔岩喷射图腾"] = "石窟智者",
		["未涂色的机械陆行鸟"] = 4,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		[5118] = 3,
		["沙尘风暴"] = "古代的石头看守者",
		["诺格弗格药剂"] = 2,
		["解散野兽"] = 3,
		["无荣誉目标"] = 5,
		["地狱烈焰效果"] = 9,
		["撕裂"] = 1,
		["爆炸陷阱"] = 3,
		[20305] = 2,
		["爆炸陷阱效果"] = 3,
		["脆弱"] = "祖罗尔",
		[1785] = 4,
		["重铸"] = "土灵筑厅师",
		["精灵之火（野性）"] = 11,
		["充电网"] = "机械守护者",
		["火焰箭"] = "帕格匹特 <Edge>",
		["暗影冥思"] = 9,
		["野性冲锋"] = 11,
		["补充法力"] = 8,
		[465] = 2,
		["审判"] = 2,
		[6756] = 11,
		["命令审判"] = 2,
		["治疗"] = "躲起来的医师",
		["显现灵魂"] = 3,
		["烈焰打击"] = "石窟地占师",
		[434] = 8,
		[12292] = 1,
		["安格弗的剑"] = 4,
		["怒不可遏"] = 1,
		["专注施法"] = 5,
		["反射"] = "玉脊蜥蜴",
		["拦截"] = 1,
		["撕咬"] = 1,
		["冷酷"] = 4,
		[19706] = 2,
		["刺骨"] = 4,
		["制造次级灵魂石"] = 9,
		["速效毒药 IV"] = 4,
		["树皮术"] = 11,
		["语言诅咒"] = 9,
		["神圣之火"] = 5,
		["Falling"] = "环境伤害 (高处坠落)",
		["槌击"] = 11,
		[19834] = 2,
		[19850] = 2,
		["机关枪"] = "步行坦克",
		[643] = 2,
		["缴械"] = "迪菲亚囚徒",
		["蛛网"] = "墓穴劫掠者",
		["断筋"] = 1,
		["毛布卷"] = 9,
		["多重射击"] = 3,
		["!Autoshot"] = 9,
		["光明圣印"] = 2,
		["牺牲祝福"] = 2,
		["诅咒增幅"] = 9,
		[20707] = 9,
		["射击"] = 8,
		["制裁之锤"] = 2,
		["神圣新星"] = 5,
		[8094] = 8,
		["星火术"] = 11,
		["黑暗契约"] = 9,
		[20288] = 2,
		["冰霜新星"] = 8,
		["安抚之吻"] = "布雷维恩 <Edge>",
		["调节"] = "麻疯技师",
		[20218] = 2,
		["厚绒线绷带"] = 9,
		["十字军打击"] = "血色豪侠",
		["暗言术：痛"] = 5,
		["魔法抑制"] = 8,
		["火焰之盾"] = 9,
		["奥术飞弹"] = 8,
		["战栗图腾"] = "格瑞姆洛克",
		["旋风斩效果"] = "赫洛德",
		["凿击"] = 4,
		[19705] = 5,
		["剥皮"] = 8,
		["神圣之盾"] = 2,
		["追踪野兽"] = 3,
		[17941] = 9,
		[8495] = 8,
		["造水术"] = 8,
		["精神"] = 4,
		["辐射之箭"] = "辐射抢劫者",
		[6673] = 1,
		["天选印记效果"] = 2,
		["圣疗术"] = 2,
		[20128] = 2,
		["庇护祝福"] = 2,
		["挫志咆哮"] = 11,
		["灵魂消耗"] = "雷希戈尔",
		["荆棘光环"] = "主宰拉姆塔斯",
		["驱毒术"] = 11,
		["召唤传送门"] = "哈卡莱护血者",
		["速效毒药"] = 4,
		["速效毒药 III"] = 4,
		[15271] = 5,
		["眩晕"] = 3,
		["嘲讽"] = 1,
		["厚甲蝎之击"] = 2,
		["横扫猛击"] = "阿塔拉利恩",
		["治疗结界"] = "剃刀沼泽图腾师",
		["辩护"] = 2,
		["束缚亡灵"] = 5,
		["盾墙"] = 1,
		[19835] = 2,
		["清晰预兆"] = 11,
		["白色强盗面罩"] = 8,
		["辐射"] = "辐射抢劫者",
		["治疗之触"] = 11,
		["石拳"] = 2,
		["痛苦诅咒"] = 9,
		["解除诅咒"] = 11,
		["召唤土狼"] = "剃刀沼泽兽王",
		["骨甲术"] = "亡首通灵师",
		["霜甲术"] = 8,
		["召唤哈卡"] = "哈卡的阴影",
		["速效毒药 V"] = 4,
		["百万伏特"] = "电刑器6000型",
		["钩网"] = "温格",
		["猎豹形态"] = 11,
		["震击"] = "电刑器6000型",
		["光明祝福"] = 2,
		["愤怒"] = "被诅咒的塞雷布拉斯",
		["生命通道"] = 9,
		["致伤"] = 4,
		["胁迫"] = 3,
		["豹群守护"] = 3,
		["心灵之火"] = 5,
		["冰冻陷阱"] = 3,
		["喂养宠物"] = 3,
		[1086] = 9,
		["自爆"] = "黑铁地雷 <黑铁密探>",
		["震荡射击"] = 3,
		["超度亡灵"] = 2,
		["虚弱诅咒"] = 9,
		["鞭笞"] = "哈卡的化身",
		["虔诚光环"] = 2,
		["召唤碎片"] = "兰斯利德",
		["火焰之盾 IV"] = "石窟织炎者",
		["地狱烈焰"] = 9,
		["瘟疫之云"] = "圣甲虫",
		["愤怒之锤"] = 2,
		["圣光术"] = 2,
		["自然迅捷"] = 11,
		["撕碎"] = 11,
		["防护暗影"] = 5,
		["银色黎明委任徽章"] = 3,
		["扭曲"] = "麻疯技师",
		["地震术"] = "剃刀沼泽震地者",
		["背刺"] = 4,
		["猛禽一击"] = 3,
		["受难"] = "萨塔斯特 <Leto>",
		["反射力场"] = "施法者克星X-21",
		["圣光击"] = "血色老兵",
		["灼烧"] = 8,
		["法力燃烧链"] = "辐射水元素",
		["唤醒地灵守护者"] = "阿扎达斯",
		["祛病术"] = 5,
		[5005] = 2,
		["肾击"] = 4,
		[19708] = 2,
		[2983] = 4,
		["追踪人型生物"] = 3,
		["倒钩"] = "尖刺鞭笞者",
		["消毒术"] = 11,
		["冰柱"] = "加兹瑞拉",
		["凝视"] = "被奴役的阿塔莱巨魔",
		["照明弹"] = 3,
		["魔甲术"] = 9,
		[19852] = 2,
		["陷地图腾"] = "剃刀沼泽图腾师",
		["精神分流"] = 5,
		["哈卡酸液"] = "哈卡的后代",
		["治疗波"] = "石窟智者",
		["圣光闪现"] = 2,
		["制造魔法翡翠"] = 8,
		["风花果"] = 2,
		["灵魂石复活"] = 9,
		[5007] = 9,
		["猫鼬撕咬"] = 3,
		["增压"] = "麻疯技师",
		[782] = 11,
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = "迪克斯特·瓦德",
		["灵魂虹吸"] = 9,
		["火焰之盾 III"] = "血色招魂师",
		["召唤追踪犬"] = 9,
		["召唤瑟莱德丝碎片"] = "瑟莱德丝卫士",
		["怒气"] = 1,
		[13163] = 3,
		["野性守护"] = 3,
		["造食术"] = 8,
		[8118] = 2,
		["毁灭"] = 11,
		[1460] = 8,
	},
	["encounter_spell_pool"] = {
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [1]
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"GUILD", -- [5]
		}, -- [2]
	},
	["__profiles"] = {
		["白银兽骑团员-碧玉矿洞"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["time_type_original"] = 2,
			["default_bg_alpha"] = 0.5,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["time_type"] = 2,
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["pvp_as_group"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["overall_flag"] = 16,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["broadcaster_enabled"] = false,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["animation_speed_triggertravel"] = 5,
			["trash_auto_remove"] = true,
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -171.555694580078,
							["x"] = -698.333374023438,
							["w"] = 310,
							["h"] = 158.000015258789,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 0,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["micro_displays_locked"] = true,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["libwindow"] = {
						["y"] = -171.555709838867,
						["x"] = 0,
						["point"] = "LEFT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["switch_tank_in_combat"] = false,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["version"] = 3,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["auto_current"] = true,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["height"] = 21,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["textR_enable_custom_text"] = false,
						["textL_enable_custom_text"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = true,
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["texture_custom"] = "",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["font_size"] = 16,
					},
					["bars_inverted"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -171.555694580078,
							["x"] = -698.333374023438,
							["w"] = 310,
							["h"] = 158.000015258789,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["bars_grow_direction"] = 1,
					["micro_displays_side"] = 2,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
				}, -- [1]
			},
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
		["白銀諾艾爾-碧玉矿洞"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["instances_segments_locked"] = false,
			["deadlog_limit"] = 16,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["instances_no_libwindow"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -201.666809082031,
							["x"] = -697.888977050781,
							["w"] = 307.333343505859,
							["h"] = 118.000350952148,
						},
						["solo"] = {
							["y"] = 1.99990844726563,
							["x"] = 1,
							["w"] = 300.000030517578,
							["h"] = 300.000061035156,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 6,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = false,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["menu_icons_size"] = 0.850000023841858,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["grab_on_top"] = false,
					["libwindow"] = {
						["y"] = -201.666793823242,
						["x"] = 1.77771806716919,
						["point"] = "LEFT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_tank_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["micro_displays_side"] = 2,
					["bars_sort_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["backdrop_texture"] = "Details Ground",
					["show_sidebars"] = false,
					["auto_current"] = true,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["version"] = 3,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -201.666809082031,
							["x"] = -697.888977050781,
							["w"] = 307.333343505859,
							["h"] = 118.000350952148,
						},
						["solo"] = {
							["y"] = 1.99990844726563,
							["x"] = 1,
							["w"] = 300.000030517578,
							["h"] = 300.000061035156,
						},
					},
					["switch_damager"] = false,
					["switch_all_roles_after_wipe"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_tank"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["textR_bracket"] = "(",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["use_spec_icons"] = false,
						["textR_enable_custom_text"] = false,
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["percent_type"] = 1,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_custom"] = "",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["skin_custom"] = "",
					["bars_inverted"] = false,
				}, -- [1]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -188.000152587891,
							["x"] = -700.11116027832,
							["w"] = 304.666656494141,
							["h"] = 153.555648803711,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textStyle"] = 2,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = false,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["clickthrough_window"] = false,
					["hide_in_combat_alpha"] = 0,
					["switch_healer_in_combat"] = false,
					["switch_damager_in_combat"] = false,
					["libwindow"] = {
						["y"] = -188.000144958496,
						["x"] = 0.888880908489227,
						["point"] = "LEFT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_grow_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["skin_custom"] = "",
					["plugins_grow_direction"] = 1,
					["grab_on_top"] = false,
					["bg_b"] = 0.0941176470588235,
					["ignore_mass_showhide"] = false,
					["auto_current"] = true,
					["micro_displays_locked"] = true,
					["version"] = 3,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["font_size"] = 16,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["height"] = 21,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["use_spec_icons"] = false,
						["texture_custom"] = "",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["percent_type"] = 1,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["textR_bracket"] = "(",
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -188.000152587891,
							["x"] = -700.11116027832,
							["w"] = 304.666656494141,
							["h"] = 153.555648803711,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["wallpaper"] = {
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["enabled"] = false,
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["clickthrough_rows"] = false,
				}, -- [2]
			},
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["use_battleground_server_parser"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["overall_clear_logout"] = false,
			["minimum_combat_time"] = 5,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = true,
				["minimapPos"] = 189.036043014893,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["memory_threshold"] = 3,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
		},
	},
	["spell_school_cache"] = {
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["global_plugin_database"] = {
	},
	["realm_sync"] = true,
	["createauraframe"] = {
		["y"] = 7.629394531250e-06,
		["x"] = -3.05175781250e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["item_level_pool"] = {
		["Player-4497-00484697"] = {
			["time"] = 1570602958,
			["name"] = "白銀諾艾爾",
			["ilvl"] = 0,
		},
	},
	["switchSaved"] = {
		["slots"] = 18,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
			{
			}, -- [25]
			{
			}, -- [26]
			{
			}, -- [27]
			{
			}, -- [28]
			{
			}, -- [29]
			{
			}, -- [30]
			{
			}, -- [31]
			{
			}, -- [32]
			{
			}, -- [33]
			{
			}, -- [34]
			{
			}, -- [35]
			{
			}, -- [36]
			{
			}, -- [37]
			{
			}, -- [38]
			{
			}, -- [39]
			{
			}, -- [40]
		},
	},
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["update_warning_timeout"] = 10,
	["show_totalhitdamage_on_overkill"] = false,
	["raid_data"] = {
	},
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 471,
		["FULL_DELETE_WINDOW"] = true,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["logons"] = 471,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["OVERALLDATA_WARNING1"] = 60,
		["MIN_COMBAT_TIME"] = true,
		["version_announce"] = 0,
		["HISTORYPANEL_TUTORIAL"] = true,
		["ctrl_click_close_tutorial"] = false,
		["OPTIONS_PANEL_OPENED"] = true,
		["bookmark_tutorial"] = false,
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["latest_news_saw"] = "",
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -3.8146972656250e-06,
		["x"] = 9.15527343750e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["attribute"] = false,
			["name"] = "有使用药水",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Trade_Alchemy_PotionD4",
			["script_version"] = 4,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\warlock_ healthstone",
			["script_version"] = 14,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_PVP_H_06",
			["script_version"] = 1,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_PVP_G_06",
			["script_version"] = 1,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Mage_IceNova",
			["script_version"] = 2,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["tooltip"] = "			--config:\n			--Background RBG and Alpha:\n			local R, G, B, A = 0, 0, 0, 0.75\n			local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n\n			--get the parameters passed\n			local spell, combat, instance = ...\n\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GC = GameCooltip\n			GC:SetOption (\"YSpacingMod\", 0)\n\n			local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n\n			if (spell.n_dmg) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    local debuff_uptime_total, cast_string = \"\", \"\"\n			    local misc_actor = instance.showing (4, _detalhes.playername)\n			    if (misc_actor) then\n				local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n				if (debuff_uptime) then\n				    debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n				end\n				\n				local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n				\n				if (not spell_cast and misc_actor.spell_cast) then\n				    local spellname = GetSpellInfo (spell.id)\n				    for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n					local casted_spellname = GetSpellInfo (casted_spellid)\n					if (casted_spellname == spellname) then\n					    spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n					end\n				    end\n				end\n				if (not spell_cast) then\n				    spell_cast = \"(|cFFFFFF00?|r)\"\n				end\n				cast_string = cast_string .. spell_cast\n			    end\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Casts:\", cast_string or \"?\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (debuff_uptime_total ~= \"\") then\n				GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n				GC:AddStatusBar (100, 1, R, G, B, A)\n			    end\n			    \n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_dmg / spell.n_amt\n			    local T = (combat_time*spell.n_dmg)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_dmg/spell.c_amt\n				local T = (combat_time*spell.c_dmg)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_dmg / T\n				\n				GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			elseif (spell.n_curado) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_curado / spell.n_amt\n			    local T = (combat_time*spell.n_curado)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_curado/spell.c_amt\n				local T = (combat_time*spell.c_curado)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_curado / T\n				\n				GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			end\n			",
			["attribute"] = false,
			["name"] = "我的技能",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\ABILITY_MAGE_ARCANEBARRAGE",
			["script_version"] = 6,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对骷髅标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 3,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对其它标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 3,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n				    local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n				    OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n				    s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n				    s = ToK (_, value) .. \" (\" .. s\n				end\n\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n				    return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					instance_container:AddValue (player, player.total)\n				    end\n				end\n\n				if (Details.in_combat) then\n				    for _, player in ipairs ( damage_container_current ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n					    instance_container:AddValue (player, player.total)        \n					end\n				    end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				local AllSpells = {}\n\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n				    AllSpells [spellID] = spellTable.total\n				end\n\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n				    AllSpells [spellID] = (AllSpells [spellID] or 0) + (spellTable.total or 0)\n				end\n\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n				    tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n				    local spellID, total = unpack (t)\n				    if (total > 1) then\n					local spellName, _, spellIcon = Details.GetSpellInfo (spellID)\n					\n					GameCooltip:AddLine (spellName, format_func (_, total))\n					Details:AddTooltipBackgroundStatusbar()\n					GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_Quests_Completed_08",
			["script_version"] = 4,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "对护盾造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 1,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["report_where"] = "PARTY",
	["lastUpdateWarning"] = 1570540217,
	["always_use_profile"] = false,
}
