
Postal3ClassicDB = {
	["global"] = {
		["BlackBook"] = {
			["alts"] = {
				"湊阿庫婭|碧玉矿洞|Alliance|10|MAGE", -- [1]
				"白銀諾艾爾|碧玉矿洞|Alliance|59|PALADIN", -- [2]
				"白银兽骑团员|碧玉矿洞|Alliance|1|HUNTER", -- [3]
			},
		},
	},
	["profileKeys"] = {
		["白銀諾艾爾 - 碧玉矿洞"] = "白銀諾艾爾 - 碧玉矿洞",
		["湊阿庫婭 - 碧玉矿洞"] = "湊阿庫婭 - 碧玉矿洞",
		["白银兽骑团员 - 碧玉矿洞"] = "白银兽骑团员 - 碧玉矿洞",
		["白银兽骑团副 - 碧玉矿洞"] = "白银兽骑团副 - 碧玉矿洞",
	},
	["profiles"] = {
		["白銀諾艾爾 - 碧玉矿洞"] = {
			["BlackBook"] = {
				["contacts"] = {
					"白银兽骑团员", -- [1]
					"白银兽骑团委", -- [2]
				},
				["recent"] = {
					"白银兽骑团员|碧玉矿洞|Alliance", -- [1]
					"艾米莉-碧玉矿洞|碧玉矿洞|Alliance", -- [2]
					"腊肉汤|碧玉矿洞|Alliance", -- [3]
					"湊阿庫婭|碧玉矿洞|Alliance", -- [4]
					"算法导论|碧玉矿洞|Alliance", -- [5]
					"法嘉斯王妃|碧玉矿洞|Alliance", -- [6]
					"白银兽骑团委|碧玉矿洞|Alliance", -- [7]
					"全弹发射|碧玉矿洞|Alliance", -- [8]
					"筱小贼|碧玉矿洞|Alliance", -- [9]
					"院长帮帮我|碧玉矿洞|Alliance", -- [10]
					"数据结构-碧玉矿洞|碧玉矿洞|Alliance", -- [11]
				},
			},
		},
		["湊阿庫婭 - 碧玉矿洞"] = {
		},
		["白银兽骑团员 - 碧玉矿洞"] = {
			["BlackBook"] = {
				["recent"] = {
					"白銀諾艾爾|碧玉矿洞|Alliance", -- [1]
				},
			},
		},
		["白银兽骑团副 - 碧玉矿洞"] = {
		},
	},
}
