
TalentedDB = {
	["global"] = {
		["templates"] = {
			["已导入 (1)"] = "aAm45r2pdDu5a",
			["已导入"] = {
				{
					0, -- [1]
					5, -- [2]
					0, -- [3]
					5, -- [4]
					0, -- [5]
					1, -- [6]
				}, -- [1]
				{
					0, -- [1]
					5, -- [2]
					3, -- [3]
					2, -- [4]
					5, -- [5]
					0, -- [6]
					3, -- [7]
					3, -- [8]
					5, -- [9]
					3, -- [10]
					0, -- [11]
					1, -- [12]
					0, -- [13]
					0, -- [14]
					1, -- [15]
				}, -- [2]
				{
					0, -- [1]
					5, -- [2]
					0, -- [3]
					0, -- [4]
					4, -- [5]
				}, -- [3]
				["class"] = "PALADIN",
				["name"] = "已导入",
				["points"] = " - |cffffd200防护 11/|cffffffff31|cffffd200/9|r",
			},
		},
	},
	["profileKeys"] = {
		["白银兽骑团员 - 碧玉矿洞"] = "白银兽骑团员 - 碧玉矿洞",
		["白銀諾艾爾 - 碧玉矿洞"] = "白銀諾艾爾 - 碧玉矿洞",
	},
	["profiles"] = {
		["白银兽骑团员 - 碧玉矿洞"] = {
		},
		["白銀諾艾爾 - 碧玉矿洞"] = {
			["framepos"] = {
				["TalentedFrame"] = {
					["y"] = 40.0000343322754,
					["x"] = 25.777795791626,
					["anchorTo"] = "CENTER",
					["anchor"] = "CENTER",
				},
			},
			["last_template"] = "已导入 (1)",
		},
	},
}
