
BuffwatchPlayerConfig = {
	["ShowPets"] = true,
	["Minimized"] = false,
	["Scale"] = 1.5,
	["ShowCastableBuffs"] = true,
	["Version"] = "1.11",
	["AnchorPoint"] = "Auto",
	["HideUnmonitored"] = false,
	["ShowAllForPlayer"] = false,
	["WindowLocked"] = true,
	["ShowOnlyMine"] = true,
	["Mode"] = "Party",
	["SortOrder"] = "Raid Order",
}
BuffwatchSaveTempEnch = {
}
BuffwatchSaveBuffs = {
	["人民币窝"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["重生的骑士"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["帅卒"] = {
		["Buffs"] = {
		},
	},
	["七仔"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["天意至尊"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["飛揚"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["妖魔山布丁"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["海豹"] = {
		["Buffs"] = {
			{
				["Buff"] = "拯救祝福",
				["Icon"] = 135967,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["希露丶普莱恩"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Rank"] = "等级 6",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["牧小白"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["涛涛浩浩"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Rank"] = "等级 6",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["惹毛了乱锤"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["低调的粉刷匠"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["一生挚爱倩"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["蜂恋蝶情"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["白銀諾艾爾"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 136051,
				["Buff"] = "庇护祝福",
			}, -- [1]
		},
	},
	["射雕英雄传"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["筱小贼"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["星方武侠"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["桉叶帝国"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["地瓜爱番薯"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["无尽的风暴"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["物理學聖劍"] = {
		["Buffs"] = {
		},
	},
	["洁白的纱布"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["犹豫就败北"] = {
		["Buffs"] = {
			{
				["Buff"] = "拯救祝福",
				["Icon"] = 135967,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["三月青衫湿"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["最爱百威"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["龙谷池岚"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Rank"] = "等级 6",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["玻璃球"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["Devops"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["绝不放弃"] = {
		["Buffs"] = {
		},
	},
	["貝貝"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135906,
				["Buff"] = "力量祝福",
			}, -- [1]
		},
	},
	["小雯雯"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Rank"] = "等级 5",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["花开城南"] = {
		["Buffs"] = {
		},
	},
	["西瓜籽"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["黑手追击令"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["维兰德星歌"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["波若波若密"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["帝国一米三"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["Fuse"] = {
		["Buffs"] = {
			{
				["Buff"] = "拯救祝福",
				["Icon"] = 135967,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["非凡光头"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Rank"] = "等级 6",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["腊肉汤"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["院长帮帮我"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["流量小心"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["全弹发射"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["算法导论"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["玩具"] = {
		["Buffs"] = {
			{
				["Buff"] = "力量祝福",
				["Icon"] = 135906,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["艾米莉"] = {
		["Buffs"] = {
			{
				["Buff"] = "拯救祝福",
				["Icon"] = 135967,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["夏风"] = {
		["Buffs"] = {
			{
				["Buff"] = "智慧祝福",
				["Rank"] = "等级 5",
				["Icon"] = 135970,
				["CasterName"] = "白銀諾艾爾",
			}, -- [1]
		},
	},
	["双皮奶"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135967,
				["Buff"] = "拯救祝福",
			}, -- [1]
		},
	},
	["心有痕"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Rank"] = "等级 5",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
	["圣人勿近"] = {
		["Buffs"] = {
			{
				["CasterName"] = "白銀諾艾爾",
				["Icon"] = 135970,
				["Buff"] = "智慧祝福",
			}, -- [1]
		},
	},
}
